{
  "Changes": [
    //Hospital - Tested
    {
      "LogName": "Hospital Events",
      "Action": "EditData",
      "Target": "Data/Events/Hospital",
      "Entries": {
        //Harvey Event 594802 - Vagina version - Tested
        "5948021/d Tue Thu/f Harvey 2000/p Harvey/n MTV_HarveyQ3/n MTV_Vagina/t 900 1500": "Hospital_Ambient/4 7/farmer 5 8 0 Harvey 4 5 0/skippable/move farmer 0 -3 1/beginSimultaneousCommand/faceDirection farmer 3/faceDirection Harvey 1/endSimultaneousCommand/speak Harvey \"Ah, @. Thank you for coming to see me. Your last physical went well, but I think we need to put you through some more rigorous testing.\"/emote farmer 16/textAboveHead \"Oh?\"/speak Harvey \"There’s nothing to worry about. You look like you’ve been taking care of yourself, eating well and exercising.\"/speak Harvey \"In fact, if you don’t mind me saying so, you look rather fit...and attractive.\"/message \"Harvey loosens his tie and glances at you nervously\"/speak Harvey \"Do you...find me attractive too?\"/emote farmer 32/speak Harvey \"I apologise. I shouldn't be asking you that right now. Anyway, We’ll begin the tests. Please remove your clothing.\"/emote farmer 16/faceDirection farmer 0/fade/viewport -300 -300/message \"You aren't 100% sure how far the doctor wanted you to strip, but he doesn't seem to try and stop you when you start putting your underwear on the nearby chair.\"/speak Harvey \"I hope you don't find it cold in here. Anyway, we’ll start with some flexibility testing. Please try and touch your toes while I check your back.\"/message \"As you bend over, Dr Harvey touches your back, slowly trailing his hand down towards your ass.\"/speak Harvey \"Very good, and your skin is remarkably soft. Please hold that position for a little longer, but tell me if it becomes uncomfortable.\"/message \"His hand drifts lower, stroking your ass, and finally resting against your pussy. You start to feel moisture gathering on your lips, and your breathing gets heavier.\"/emote farmer 16/speak Harvey \"Don’t push yourself, but please hold that pose a little longer. I need to see how much you can take.\"/message \"Harvey strokes between your pussy lips, and gently inserts a gloved finger into your pussy. You gasp a little at the cold invader, and he removes his finger\"/speak Harvey \"I see you are sensitive. Would you consider this reaction normal for you, or is this position increasing your sensitivity?\"/quickQuestion Is this reaction normal for you, or is this position increasing your sensitivity?#This is normal#This position is arousing me(break)speak Harvey \"I see. I guess you know your body pretty well.\"(break)speak Harvey \"Ah. I assume there is something about this situation that is arousing you more than usual.\"/message \"You stand up and move over to the bed, resting your weight on it and presenting yourself to the horny doctor.\"/message \"Harvey undoes his belt and lowers his pants, then slips on a condom with practised ease.\"/message \"He presses his cock against your entrance and teases you with the head by rubbing it up and down your labia, coating it in your juices.\"/message \"You start moaning, and he takes this as his cue, smoothly plunging deep inside you. You gasp, and he pauses to let you adjust.\"/speak Harvey \"Are you feeling any discomfort or pain, @?\"/question \"Are you comfortable?#Yes#Moan\"/emote farmer 32/speak Harvey \"I’ll continue with the test then.\"/message \"Harvey starts thrusting into you again, the sounds of your intercourse filling the echoey examination room.\"/message \"You settle into a rhythm of Harvey grunting and you moaning, and it’s not long before you are getting close to the edge.\"/message \"You start cumming, leaning on the bed for support, as your orgasm racks your body, causing you to clench down on the cock deep inside your pussy.\"/message \"Apparently Harvey is not too far behind you, as you feel him start to hammer away at you faster in order to try and finish.\"/message \"In a few moments he pushes as deeply into you as he can, and you feel the condom start to inflate as his cum fills it inside you.\"/speak Harvey \"@...your body is...fantastic. You are in...such good shape.\"/message \"Harvey leans against your body, clearly exhausted from this session. You move a little to the side and he lies on the bed beside you, his cock slipping out of your pussy.\"/message \"After a few minutes of half lying on the bed you both get up, and Harvey hands you some surgical wipes to clean yourself with while he disposes of the condom.\"/speak Harvey \"Well, @. I’d say that you are in perfect health. Please feel free to return any time you want another check up.\"/mail MTV_HarveyQ3T/end",

        //Harvey Event 594802 - Herm version - Tested
        "5948022/d Tue Thu/f Harvey 2000/p Harvey/n MTV_HarveyQ3/n MTV_Herm/t 900 1500": "Hospital_Ambient/4 7/farmer 5 8 0 Harvey 4 5 0/skippable/move farmer 0 -3 1/beginSimultaneousCommand/faceDirection farmer 3/faceDirection Harvey 1/endSimultaneousCommand/speak Harvey \"Ah, @. Thank you for coming to see me. Your last physical went well, but I think we need to put you through some more rigorous testing.\"/emote farmer 16/textAboveHead \"Oh?\"/speak Harvey \"There’s nothing to worry about. You look like you’ve been taking care of yourself, eating well and exercising.\"/speak Harvey \"In fact, if you don’t mind me saying so, you look rather fit...and attractive.\"/message \"Harvey loosens his tie and glances at you nervously\"/speak Harvey \"Do you...find me attractive too?\"/emote farmer 32/speak Harvey \"I apologise. I shouldn't be asking you that right now. Anyway, We’ll begin the tests. Please remove your clothing.\"/emote farmer 16/faceDirection farmer 0/fade/viewport -300 -300/message \"You aren't 100% sure how far the doctor wanted you to strip, but he doesn't seem to try and stop you when you start putting your underwear on the nearby chair.\"/speak Harvey \"I hope you don't find it cold in here. Anyway, we’ll start with some flexibility testing. Please try and touch your toes while I check your back.\"/message \"As you bend over, Dr Harvey touches your back, slowly trailing his hand down towards your ass.\"/speak Harvey \"Very good, and your skin is remarkably soft. Please hold that position for a little longer, but tell me if it becomes uncomfortable.\"/message \"His hand drifts lower, stroking your ass, reaching under you to fondle your testicles, and finally resting against your pussy. You start to feel moisture gathering on your lips, blood rushing to your penis, and your breathing gets heavier.\"/emote farmer 16/speak Harvey \"Don’t push yourself, but please hold that pose a little longer. I need to see how much you can take.\"/message \"You hear Dr Harvey applying some medical lubricant, and then feel him stroke between your pussy lips. The gel is cool as he gently inserts a finger into your pussy. You gasp a little at the cold invader.\"/speak Harvey \"I see you are sensitive. Would you consider this reaction normal for you, or is this position increasing your sensitivity?\"/quickQuestion Is this reaction normal for you, or is this position increasing your sensitivity?#This position is arousing me#This is normal(break)speak Harvey \"I see. I guess you know your body pretty well.\"(break)speak Harvey \"Ah. I assume there is something about this situation that is arousing you more than usual.\"\"/speak Harvey \"I'm sure I can find a way for both of us to release the tension. Would you mind making yourself comfortable and leaning against the bed over there?#$b#I have some...alternative medicine...we can try.\"/message \"You stand up and move over to the bed, resting your weight on it and presenting yourself to the horny doctor.\"/message \"Harvey undoes his belt and lowers his pants, and slips on a condom with practised ease.\"/message \"He presses his cock against your entrance and teases you with the head by rubbing it up and down your labia, coating it in your juices.\"/message \"You start moaning, and he takes this as his cue, smoothly plunging deep inside you. You gasp, and he pauses to let you adjust.\"/speak Harvey \"Are you feeling any discomfort or pain, @?\"/question \"Are you comfortable?#Yes#Moan\"/emote farmer 32/speak Harvey \"I’ll continue with the test then.\"/message \"Harvey starts thrusting into you again, the sounds of your intercourse filling the echoey examination room.\"/message \"You settle into a rhythm of Harvey grunting and you moaning, and it’s not long before you are getting close to the edge.\"/message \"You start cumming, leaning on the bed for support, as your orgasm racks your body, causing you to clench down on the cock deep inside your pussy.\"/message \"Apparently Harvey is not too far behind you, as you feel him start to hammer away at you faster in order to try and finish.\"/message \"In a few moments he pushes as deeply into you as he can, and you feel the condom start to inflate as his cum fills it inside you.\"/speak Harvey \"@...your body is...fantastic. You are in...such good shape.\"/message \"Harvey leans against your body, clearly exhausted from this session. You move a little to the side and he lies on the bed beside you, his cock slipping out of your pussy.\"/message \"After a few minutes of half lying on the bed you both get up, and Harvey hands you some surgical wipes to clean yourself with while he disposes of the condom.\"/speak Harvey \"Well, @. I’d say that you are in perfect health. Please feel free to return any time you want another check up.\"/mail MTV_HarveyQ3T/end",

        //Maru/Harvey Event 594803 - Vagina version! - Tested
        "5948031/d Mon Wed Fri Sat Sun/f Harvey 2000/f Maru 2000/p Harvey/p Maru/n MTV_HarveyQ4/n MTV_Vagina/t 900 1500": "Hospital_Ambient/4 7/farmer 6 17 0 Harvey 3 7 0 Maru 1 5 2/skippable/changeSprite Maru Hospital/changePortrait Maru Hospital/pause 500/speak Harvey \"Nurse Maru, can you please get the topical cream ready for the next patient. It should be in the cupboard beside you.\"/speak Maru \"Of course, Dr. Harvey.\"/move Maru 3 0 1/pause 300/faceDirection Maru 0/pause 700/textAboveHead Harvey \"I love the perks of this job\"/pause 700/message \"Maru sees what Harvey is doing, gives her ass a wiggle, and then flips her skirt up to show him her naked behind.\"/speak Maru \"Like what you see, *doctor* Harvey? I'm sure we can find some time for you to *examine* me afterwards.\"/textAboveHead Harvey \"Such a tease\"/pause 300/speak Maru \"I think I heard someone enter, so that might be them right now. Anyway, let me go and see who is waiting at the front.\"/beginSimultaneousCommand/fade/viewport 5 15/warp Maru 6 15/faceDirection Maru 2/endSimultaneousCommand /speak Maru \"Good morning @. I'm sorry you had to wait, we were just getting everything ready for you in the back. The doctor will be ready for you in a moment.\"/emote farmer 16/faceDirection Maru 0/textAboveHead Maru \"Dr Harvey, the trial patient is here\"/pause 3500/textAboveHead Maru \"Ok, I'll bring them in\"/pause 500/faceDirection Maru 2/speak Maru \"Ok, you can head in now. I hope you don't mind but Dr Harvey asked me to assist him today so that I can observe and learn.\"/emote farmer 16/pause 300/beginSimultaneousCommand/fade/viewport 15 6/warp Maru 14 6/warp farmer 15 4/warp Harvey 15 6/faceDirection farmer 2/faceDirection Harvey 0/faceDirection Maru 0/endSimultaneousCommand/speak Harvey \"Ah, @. I'm really glad you decided to take part in this trial. We have so much to learn about the human body, and yours is just delightful.\"/pause 400/faceDirection Harvey 3/pause 300/speak Harvey \"Nurse Maru, Can you assist the patient and get them situated on the bed, please? Make sure you remove all of their clothing before we begin.\"/beginSimultaneousCommand/fade/viewport -300 -300/endSimultaneousCommand/message \"Maru helps you remove your clothing, placing it on the nearby chair. You lie down down on the bed.\"/speak Maru \"Are you comfortable, @? \"/question null \"Are you comfortable?#Yes\"/message \"Maru looks down at your naked body and smiles reassuringly, then reaches out her gloved hands and gently opens your legs.\"/message \"She takes a jar of ointment and applies some directly to the outside of your labia, then starts rubbing some into your breasts, causing your nipples to get hard. She stops far too soon.\"/speak Maru \"Dr Harvey, the patient is ready for you now. Do you want me to provide stimulation? \"/pause 500/speak Harvey \"Hmm, not at this time, Nurse Maru. Although you have a very good bedside manner, this is a moment for observation.\"/message \"Dr Harvey switches places with Nurse Maru and starts gently massaging your breasts, causing your nipples to stand even more erect. You feel your lower lips start swelling without being touched.\"/speak Maru \"Doctor Harvey, I can see that she is getting aroused. Her labia majora are swelling up and her clitoral hood seems to be getting more retracting. Should I check for secretions? \"/speak Harvey \"Please do, Nurse. Let me know what information you can glean from examing the patients fluids.\"/message \"Nurse Maru leans over while Dr Harvey is rubbing your chest, and slides a gloved finger up your slit, purposefully rubbing against your clitoris. She brings her finger to her face and gently sniffs the tip.\"/speak Maru \"Patient's secretions are mildly scented. Should I perform a taste test, doctor? \"/speak Harvey \"Of course, Nurse Maru. The ointment that you applied is safe for ingestion, and was designed to be tasteless but may add a slightly oily texture.\"/message \"Maru looks you straight in the eyes, opens her mouth and starts sensually sucking on her finger. She uses her other hand to start groping her breast, and lets out a low moan as she withdraws her finger from her mouth.\"/speak Maru \"Patient's fluid is sweet as expected, doctor. \"/pause 400/speak Harvey \"I think it is time for you to demonstrate what you have learned so far, Nurse. Please proceed with the next stage of the treatment.\"/pause 400/message \"Nurse Maru approaches you on the bed and starts rubbing some of the ointment on to her gloved hands. She reaches between your legs and gently seperates your lips with both hands.\"/message \"She uses the finger and thumb of each hand, sliding up and down, to massage your lips. The ointment seems to be causing you to feel a tingling sensation wherever she touches, and you start panting.\"/message \"Satisfied with your response, and the amount of liquid you are producing, she slips one of her fingers inside your entrance, using it to gently probe you.\"/speak Harvey \"Now, remember the aim of this trial, Nurse Maru. We are not directly trying to bring the patient to orgasm, merely to see how the ointment affects their liquid secretions.\"/speak Harvey \"@, please try to hold off as long as possible.\"/message \"You realise that you are going to be fighting a losing battle. Maru is definitely very adept at this, and during Dr Harvey's speech she had slipped a second finger inside you and is pumping away methodically.\"/message \"Slightly chastised, she slows down and withdraws her fingers while Dr Harvey jots down a note about your gushing vagina.\"/message \"While he is distracted, Maru scoops up some of your juices in her off hand, and reaches down under her skirt. She gives you a sneaky smile, and starts rubbing your secretions into her sopping wet cunt.\"/speak Maru \"Doctor, I think that @ is being a very good patient, and I don't want to scare her off of any future trials. Perhaps this time we can speed up the process a little? \"/pause 400/speak Harvey \"Ah, good point. Perhaps we should put on a little show for her, as thanks?\"/speak Harvey \"I also see that you have been a very naughty nurse while you thought I wasn't looking? It looks like that needs addressing immediately, you lusty nurse.\"/message \"Dr Harvey undoes his belt and drops his pants, then flips up Nurse Maru's skirt and gives her bare behind a playful swat.\"/message \"Maru gives out a little yelp, which quickly turns into a loud moan as she feels him enter her dropping hole. She tries to stay proffesional though and, with shaking hands, goes back to fingering you.\"/pause 300/playSound fishSlap/pause 300/playSound fishSlap/pause 300/message \"With this erotic display happening right in front of you, you are on the edge in no time. You shout a warning to Maru that you are about to cum, and she she starts rapidly rubbing your clit, bringing you to a powerful orgasm.\"/message \"Harvey takes this as his cue, and starts firing his hot load deep inside Maru, who starts shaking on top of you as well.\"/pause 1000/speak Harvey \"Well, Nurse Maru, even though we got a little distracted, I think we can call this trial a success.#$b#If the pool collecting under @ right now is any indication I think we are on to a winner.\"/speak Harvey \"Once you have both taken a moment to recover, can you clean up the patient and debrief them on the experience?#$b#Make sure you document absolutely everything.\"/pause 300/speak Maru \"Thank you for that, @. I hope you'll take part if we have another trial in the future. \"/mail MTV_HarveyQ4T/end"
      }
    },

    //Seedshop - tested
    {
      "LogName": "SeedShop Events",
      "Action": "EditData",
      "Target": "Data/Events/Seedshop",
      "Entries": {
        //#region Abigail reward event 594801 - completed!
        "594801/d Mon Wed Fri/f Abigail 2000/n MTV_AbigailQ4/n MTV_Vagina/t 1900 2400": "echos/13 8/farmer 13 10 0 Abigail 14 6 1/skippable/move farmer 0 -4 0/faceDirection farmer 1/message \"Abigail is on her computer setting up her stream. Unusually, she is wearing a skirt and a loose top, and you can see that she's not wearing a bra.\"/pause 300/speak Abigail \"Oh, hey there @. I'm just getting the stream all set up for tonight. Are you ready to have your world rocked?\"/emote farmer 16/pause 300/speak Abigail \"Great, everything is all ready. I just need to make sure that you are good to go and then we can start the stream. Everyone is going to love this so much.\"/emote farmer 16/faceDirection Abigail 3/message \"Abigails swivels around on her chair, and looks you up and down. She reaches forward and adjusts your hair a little, brushes some dirt off of you, and generally gets you ready for an audience.\"/pause 300/speak Abigail \"Of course, I'm gonna rip all of that off you as soon as I can, but that's part of the fun. My fans think I'm a wild girl, and I want to keep it that way.$h\"/emote Abigail 16/speak Abigail \"Ok, time to start the stream!\"/fade/viewport -300 -300/pause 500/faceDirection Abigail 1/speak Abigail \"Ok everyone. You asked for it, so we have a special guest tonight to 'help' me out, and help me cum.#$b#This here is the wonderful gal who grows those veggies so darn big on her farm.\"/speak Abigail \"Of course, everything that I've put inside myself for you has been in her hands, and tonight I want to see if I can get at least one of her hands inside me as well.\"/emote farmer 32/speak Abigail \"Anyway, time to get started. I'm already dripping and this pussy is going to start tightening up again if I wait too long.#Everyone get a good long look at @ because this may be the only time you get to see me strip her on camera.\"/message \"Abigail turns around and flashes the webcam, giving her viewers a view up her skirt as she crawls towards you on the floor.#She quickly loses her skirt, revealing a bare ass underneath, and wiggles it as she grabs ahold of your pants. She wastes no time in stripping you, making sure her viewers get the best view of the two of you.\"/emote Abigail 16/speak Abigail \"Well, what did I tell you? @ is smoking hot, and my pussy juices are dripping onto the floor right now. She makes me so hot that I can barely control myself.\"/emote farmer 16/message \"Abigail lies on her back, and pulls your hips above her head so the camera can see her licking your pussy. She uses her tongue to lick up your valley, and then starts stroking your clit with her finger.#You moan a little as she uses her other hand to spread your lips for the camera, and then inserts her first finger inside you, causing your fluid to squelch out and drip onto her face.#Abigail looks straight into the camera, opens her mouth, and pushes two fingers inside you to get more of your fluid to drip out.\"/speak Abigail \"Only tasty things come from @'s farm, and she is no exception. Now that she's warmed up, I think it's time I switched places and got serious.\"/message \"Abigail and you spend the next 45mins trying out each of her sex toys, in order to 'warm her up for the main event'. By this time both of you are panting away, and you've already cum twice.\"/speak Abigail \"Ok, here we go. @, start off with three fingers, and lots of lube. I'm already soaking wet, but every little helps.#$b#That's it, keep pushing your fingers into my wet snatch, and try and get that fourth finger in there.\"/pause 300/playSound fishSlap/pause 300/playSound fishSlap/speak Abigail \"Here it goes, viewers! @, I'm ready for you! Keep pushing and get that beautiful hand inside me...\"/pause 300/speak Abigail \"Ooooh yes! The stretch is sooo good! I'm cumming!\"/message \"Abigail starts shaking on top of you, and you wriggle your fingers inside her to make her cum explosively. After a few minutes, she recovers, and you gently remove your hand from her loose pussy.\"/speak Abigail \"Well viewers, I think I'm well and truly done for tonight. Look at this giant, gaping hole where my pussy was an hour ago! I hope you also came a ton and had a great time. Anyway, I'm signing off now - come back for my next show!\"/mail MTV_AbigailQ4T/end"

      }
    },

    //LeahHouse - tested
    {
      "LogName": "Leah's Cottage Events",
      "Action": "EditData",
      "Target": "Data/Events/LeahHouse",
      "Entries": {
        //Leah painting quest 594829 - Vagina version - tested
        "5948041/n MTV_LeahQ1/n MTV_Vagina/f Leah 2000/p Leah": "echos/6 5/farmer 7 9 0 Leah 6 5 0/skippable/move farmer 0 -4 0/pause 300/beginSimultaneousCommand/faceDirection farmer 3/faceDirection Leah 1/endSimultaneousCommand/pause 500/textAboveHead Leah \"Oh, there you are\"/emote farmer 32/pause 1500/speak Leah \"Thank you for helping me out with this, @. I don't know why I haven't painted you yet, but today that changes.\"/move Leah -1 0 1/message \"Leah takes a step back, and thoughtfully looks you up and down.\"/speak Leah \"We have pretty good lighting in here, and I try to keep my cottage pretty warm all year round.\"/speak Leah \"I'm sure people would appreciate a painting with your nipples standing on end, but I think we can make that happen anyway with the right...stimulation.\"/move Leah 1 0 1/message \"Leah steps close to you and places her hands on your chest, lightly caressing you through your work attire.\"/speak Leah \"I think it's time these clothes started covering up that chair over there instead of your glorious body, don't you?\"/emote farmer 60/faceDirection Leah 0/pause 300/beginSimultaneousCommand/fade/viewport -300 -300/endSimultaneousCommand/message \"As Leah turns back to her easel, wrestling it in to position, you start undressing. You notice her glancing at you, and she seems distracted while getting her paints and brushes ready.\"/speak Leah \"Wow, I wish I could paint this scene, it's like I'm getting my very own striptease...But I've never been very good at capturing motion on canvas. \"/message \"You slyly half turn, making sure Leah has a good view of your plump rump, and lock eyes with her over your shoulder.\"/speak Leah \"As classic as that pose is, I was thinking we could go for something a little more...erotic, if you're up for it?\"/question fork0 \"What pose do you want to strike for Leah?#Something classical#Something erotic\"/fork 5948041classy /speak Leah \"Well, I guess I'd better get you ready. I want everyone who sees this painting to either get wet or get hard from looking at it.\"/textAboveHead Leah \"Just like I am right now...\"/pause 2000/message \"Leah walks over to you, loosely holding a naked, paintless brush in her hand. She uses it's soft tip to slowly circle your left breast, causing your nipples to start hardening as she promised.\"/message \"You shake your head, and she uses your moment of distraction to brush your nipple, sending a jolt straight through your body. She slowly drags the tip of the brush across your chest, and flicks it over your other nipple, causing your knees to buckle slightly.\"/speak Leah \"Now, now, @. I'm going to need you to hold a pose. I can't exactly paint you if you're writhing on the floor in bliss.#$b#I mean, I could, but then I'd be on the floor with you.\"/message \"Leah helps you pick an erotic but natural position, and you do your best 'Venus de Milo' pose as Leah starts sketching your form. Every so often she notices you start to get restless and comes over to provide you with a 'helping hand' in the form of some gentle caresses or stimulating stroking.\"/pause 1000/speak Leah \"Ok, @. I think I'm almost done for today. I can fill in the rest later, but I think my wonderful muse deserves a treat.#$b#Staring at your sexy, naked form all day has caused me to paint a different kind of picture on the floor by my easel.\"/message \"Leah cleans her brush and rests it on the stand, then walks over to you, pausing every couple of steps as she strips out of her clothing. She has smudge marks on her face from where she has wiped away her sweat, and her ponytail has come loose, but she looks as stunning as ever.#Leah presses her naked form against yours, and starts rubbing herself against you. She hooks one leg around yours, and slowly slides down your thigh, leaving a wet trail. She lets out a little moan.\"/speak Leah \"Oh @, can you feel just how wet you make me?\"/message \"Leahs hands stroke reach around your waist, grabbing a your butt and squeezing as she brings her mouth to your sex and inhales.#She takes your lips her mouth, and starts sucking softly, licking up the inside and then circling the entrance to your secret place.#You rest your hands on her head for support as she goes to town on you, showing the same dedication and skill to your form as she did to her painting, bringing colour to your body as it flushes, and causing your lips to swell with lust. She pauses for a moment, and asks you to lie down on her rug, then dives back between your legs.#The light from the fireplace casts shadows on the wall, your form mingling with Leah's as she coaxes your closer to orgasm. She starts licking and sucking your clit as her fingers pump in and out of your leaking pussy, her other hand furious between her own legs.\"/speak Leah \"@...@...I'm getting close. Cum for me, please?\"/message \"Your orgasm washes over you, and you clench you legs together. Leah's body starts shaking as well, and the two of your writhe on the floor, sharing your bliss.\"/pause 1500/speak Leah \"Wow. I know the theme of the competition is 'The Beautiful Body', but I don't think there's any way for me to encompass just how beautiful you are in a painting.#$b#We might have to make you an interactive exhibit...$h#Anyway, can we just lie here for a while? I want to cuddle with you in front of the fire, and I don't think I'll be able to stand up for a while anyway...\"/pause 1500/addMailReceived MTV_LeahQ1P/end",

        // classy variant - tested
        "5948041classy": "/speak Leah \"Well, I guess I'd better get you ready. I want everyone who sees this painting to really understand just how beautiful the human form is.\"/message \"Leah helps you pick a classic and natural pose, and you do your best 'Venus de Milo' as Leah starts sketching your form. Every so often she notices you start to get restless and comes over to give you a little massage or rub to loosen you up again.\"/pause 1000/speak Leah \"Ok, @. I think I'm almost done for today. I can fill in the rest later, but I think my wonderful muse deserves a treat. Staring at your sexy, naked form all day has caused me to paint a different kind of picture on the floor by my easel.\"/message \"Leah cleans her brush and rests it on the stand, then walks over to you, pausing every couple of steps as she strips out of her clothing. She has smudge marks on her face from where she has wiped away her sweat, and her ponytail has come loose, but she looks as stunning as ever.#Leah presses her naked form against yours, and starts rubbing herself against you. She hooks one leg around yours, and slowly slides down your thigh, leaving a wet trail. She lets out a little moan.\"/speak Leah \"Oh @, can you feel just how wet you make me?\"/message \"Leahs hands stroke reach around your waist, grabbing your butt and squeezing as she brings her mouth to your sex and inhales. She takes your lips into her mouth, and starts sucking softly, licking up the inside and then circling the entrance to your secret place#You rest your hands on her head for support as she goes to town on you, showing the same dedication and skill to your form as she did to her painting, bringing colour to your body as it flushes, and causing your lips to swell with lust. She pauses for a moment, and asks you to lie down on her rug, then dives back between your legs.#The light from the fireplace casts shadows on the wall, your form mingling with Leah's as she coaxes your closer to orgasm. She starts licking and sucking your clit as her fingers pump in and out of your leaking pussy, her other hand furious between her own legs.\"/speak Leah \"@...@...I'm getting close. Cum for me, please?\"/message \"Your orgasm washes over you, and you clench you legs together. Leah's body starts shaking as well, and the two of your writhe on the floor, sharing your bliss.\"/pause 1500/speak Leah \"Wow. I know the theme of the competition is 'The Beautiful Body', but I don't think there's any way for me to encompass just how beautiful you are in a painting. We might have to make you an interactive exhibit...$h#Anyway, can we just lie here for a while? I want to cuddle with you in front of the fire, and I don't think I'll be able to stand up for a while anyway...\"/pause 1500/addMailReceived MTV_LeahQ1P/end",



        //594810 Leah visit show quest 594831 - started by WAILT. ACE version
        "594810/f Leah 1500/n MTV_Ace/n MTV_LeahQ3": "playful/-100 -100/farmer 14 23 0 Leah 40 18 1/skippable/viewport -100 -100/message \"The exhibit is in a building with blacked out windows. You’re a little nervous, but Leah confidently takes your hand and leads you inside.#The person at the front desk checks your IDs before motioning for you to go back. You and Leah part the thick black curtain that hangs in the entryway and step through.#The first thing you see is a small platform where a nude man kneels on a soft looking pillow, arms bound by leather cuffs in front of him. His eyes are covered by a dark blindfold. Around his neck hangs a sign that says ’No Photography’.#Next to him is a throne, where another man, wearing a leather harness over a crisp white button up, sits with a goblet in one hand, talking to a few guests. His other hand is running through the kneeling man’s hair.#You look at Leah unsure but she’s looking towards the stage where a large metal frame with loops and hooks hanging from the top bars. Hanging from the bar is a large hoop on which a woman in a sparkling leotard is doing aerial acrobatics.\"/speak Leah \"Let’s go find seats. I want to watch the aerial performances.\"/message \"You follow along, looking around as you do. There are a lot of different static pieces. People wrapped in leather and latex, bound in various positions, modeling harnesses, cuffs, masks, and more.#Leah drags you to a seat, close to the front, squeezing your hand before pulling out a sketch pad. You both watch the show in awe. The strength of the hoop and silk artists bodies is incredible.#When the next group comes on stage carrying a bag full of ropes, Leah gets an excited look in her eye. Two women wearing sheer colored lacy lingerie and gauzy butterfly wings begin setting up their rope.#Their bodies are both wrapped in rope harnesses. You can see the way it presses into their skin and you can’t help but imagine how that would feel on you.#They do a series of positions, the woman dressed in blue suspended in the air. The ropes have on her back, hanging with a leg tied underneath her to her thigh where they frame her figure beautifully.#By the time the show is over, you can’t stop imagining how stunning rope art is. There’s something beautiful in the constriction. Leah takes your hand and you can’t help but grin at how flushed her cheeks are.\"/speak Leah \"Let’s go back to my place and I can tell you my ideas.\"/message \"You nod and follow her to the exit. On your way out, you see a person sitting on a motor bunny, arms bound behind their back, while another plays with the controls.#The one riding the toy looks like they’re in miserable ecstasy, tears streaking their face and, by the mess on the floor, you’re pretty sure they’ve cum more than a few times already. There’s a strange beauty in the way they cry.\"/speak Leah \"I'm so excited about the coming exhibit. I can't wait to show you the ideas this has given me.\"/quickquestion \"Do you want to head back with Leah and cuddle in her cottage?#Go home with Leah and cuddle.#Say goodnight to Leah.(break)switchEvent 594804R2 (break)switchEvent 594804R3/end",

        //594811 Leah visit show quest 594831 - started by WAILT. Vagina version
        "594811/f Leah 1500/n MTV_Vagina/n MTV_LeahQ3": "playful/-100 -100/farmer 7 9 0 Leah 6 5 0/skippable/viewport -100 -100/message \"The exhibit is in a building with blacked out windows. You’re a little nervous, but Leah confidently takes your hand and leads you inside.#The person at the front desk checks your IDs before motioning for you to go back. You and Leah part the thick black curtain that hangs in the entryway and step through.#The first thing you see is a small platform where a nude man kneels on a soft looking pillow, arms bound by leather cuffs in front of him. His eyes are covered by a dark blindfold. Around his neck hangs a sign that says ’No Photography’.#Next to him is a throne, where another man, wearing a leather harness over a crisp white button up, sits with a goblet in one hand, talking to a few guests. His other hand is running through the kneeling man’s hair.#You look at Leah unsure but she’s looking towards the stage where a large metal frame with loops and hooks hanging from the top bars. Hanging from the bar is a large hoop on which a woman in a sparkling leotard is doing aerial acrobatics.\"/speak Leah \"Let’s go find seats. I want to watch the aerial performances.\"/message \"You follow along, looking around as you do. There are a lot of different static pieces. People wrapped in leather and latex, bound in various positions, modeling harnesses, cuffs, masks, and more.#Leah drags you to a seat, close to the front, squeezing your hand before pulling out a sketch pad. You both watch the show in awe. The strength of the hoop and silk artists bodies is incredible.#When the next group comes on stage carrying a bag full of ropes, Leah gets an excited look in her eye. Two women wearing shear colored lacy lingerie and gauzy butterfly wings begin setting up their rope.#Their bodies are both wrapped in rope harnesses. You can see the way it presses into their skin and you can’t help but imagine how that would feel on you. A shiver crawls up your spine and your pussy clenches around nothing.#They do a series of positions, the woman dressed in blue suspended in the air. The ropes have her on her back, hanging with a leg tied underneath her to her thigh where they frame her ass beautifully.#By the time the show is over, you’re so wet you’re worried it’s seeped through the fabric of your bottoms. Leah’s squeezing her legs together so at least you know you’re not alone. Leah takes your hand and you can’t help but grin at how flushed her cheeks are.\"/speak Leah \"Let’s go back to my place and I can tell you my ideas.\"/message \"You nod and follow her to the exit. On your way out, you see a person sitting on a motor bunny, arms bound behind their back, while another plays with the controls.#The one riding the toy looks like they’re in miserable ecstasy tears streaking their face and, by the mess on the floor, you’re pretty sure they’ve cum more than a few times already.#When you get out, you’re not sure how much longer you can wait before you need to fuck yourself into orgasm. Or maybe, Leah would be willing to help you out.\"/quickQuestion \"Do you want to head back with Leah and cuddle in her cottage?#See if Leah is up for getting rid of that sexual frustration.#Go home with Leah and cuddle.#Head home(break)switchEvent 594804R1(break)switchEvent 594804R2(break)switchEvent 594804R3/end",

        //Result 1 - Sex
        "594804R1": "viewport 7 7/warp farmer 7 9 0/warp Leah 7 8 2/message \"Farmer and Leah enter Leah’s house.\"/move Leah 0 -1 2/pause 300/beginSimultaneousCommand/move Leah 0 -2 2 true/move farmer 0 -3 0 true/endSimultaneousCommand/speak Leah \"Well, thank you for coming. That show was definitely...enlightening.\"/question null \"#Did you gain anything from it?\"/speak Leah \"I got a lot of new ideas, though that’s not all.\"/emote Leah 60/speak Leah \"Everything was so erotic, I got really wet from watching it. Would you want to give me a hand?\"/message \"Trigger Warning: If you choose to help Leah the scene involves consensual rope bondage.\"/quickquestion \"Do you want to help Leah get off?#Definitely, let’s give her a private show.#That’s not really my thing, but we can cuddle.#I’m too tired to do anything tonight.(break)Fade(break)switchEvent 594804R2(break)switchEvent 594804R3/beginSimultaneousCommand/viewport 5 5/move Leah -3 0 1/move farmer 0 -1 3/endSimultaneousCommand/move farmer -2 0 3/message \"You step close to Leah and brush her hair back behind her ear. She looks stunning, her gray brown eyes sparkling from the low firelight.\"/message \"A soft blush has spread high on her cheeks and you can't help but kiss it. Her eyes flutter closed and she lets out a soft gasp. You pull back after a quick peck to her nose.\"/message \"You look at her bed and notice there are cotton ropes tied to the bedposts and the shears on the side table. Leah notices you looking and follows your gaze. Her flush gets brighter.\"/question null \"#Would you like me to use those on you?\"/speak Leah \"Yes, please.\"/pause 300/fade/viewport -100 -100/message \"You kiss her hard and filthily, tongues slicking together before you pull back abruptly. You strip her of her top and bra, trailing kisses up her stomach as you do, then sit her on the bed.\"/message \"You pull off her shoes and socks, tucking them under the bed. You stand her up, undo the buttons of her pants, and slide them down her legs until she can step out. You fold them neatly and place them next to her shoes.\"/message \"You undress yourself and she watches you, her blush spreading down her chest.\"/question \"#Let me know if you need me to stop at any time. Do you have a safeword? Do you have any limits that we haven’t talked about before?\"/speak Leah \"The light system. Red for stop, yellow for slow down, pause, talk it out and green for keep going. Same limits as before, no teeth being the biggest.\"/message \"You smile softly and give her a gentle kiss before you use a single column tie (thank you, college experimentation) to secure the cotton rope around each wrist and ankle, checking in with her as you do, until she’s spread eagle.\"/message \" You climb onto the bed between her legs, rubbing your hands up and down her thighs, her skin soft with the slight tickle of hair.\"/question null \"#Color?\"/speak Leah \"Green.\"/message \"You finally allow yourself to look at her fully. You curse softly under your breath. You don’t know if you’ve ever seen anything so beautiful. The color of the ropes contrasts beautifully with her skin.#Your eyes fall on her underwear, a pair of dark green boyshorts. She wasn’t exaggerating when she said she soaked them through. The crotch is stained darker, spread all the way to where the shorts stop - an inch down her thighs.#You lay on your stomach and press your face against the fabric, covering her pussy. She smells of clean sweat. You drag your tongue against the fabric tasting the slight saltiness of it mixing with the mild taste of her slick.#She moans as you continue to lick, then gasps when you pull the fabric into your mouth and suck. You pull away once you’ve gotten all the flavor from it. Leah’s looking at you half lidded, with a small smirk.#You notice the small buttons on the sides of her underwear and snap them open. She must’ve been hoping for something like this if she wore those. You pull them off, and drop them on the pile of her clothes before your gaze falls to her pussy.#Leah’s dripping slick, the hair matted down and shiny. You meet her eyes, giving a devilish smirk, before dropping down, parting her lips with your nose, wrapping your mouth around her clit and sucking hard.\"/speak Leah \"Oh Yoba!\"/message \"You’re careful to keep your lips over your teeth as you suck at her, then dip your tongue low and slurp up her juices. You’ve never tasted anything so good. She tastes fresh and natural and you continue using your tongue to clean up every bit of slick.\"/message \"Leah is moaning, her arms and legs jerking as they try to close around your head.\"/question null \"#Color?\"/speak Leah \"Green! More! Please, more!\"/message \"You dip your head further, using your nose to rub against her clit as you lick around her entrance until you finally bury your tongue inside her.#You fuck your tongue inside, making sure to curl it up to try and hit her g-spot while the tip of your nose rubs her clit. Leah’s moans are beautiful and you can hear her breath getting quicker.#You thrust in a few more times before licking up to her clit, using your tongue to get under its hood and then you suck on it. The strong pressure pulls Leah over into an explosive orgasm, slick drenching her thighs.#You work her clit until her orgasm tapers off and then slowly clean her up with your mouth, making sure to be as gentle as possible.#When you’ve licked everything up, you crawl up Leah’s body and kiss her hungrily, letting her taste herself. She moans into it, lips slow and dragging against yours.#You pull back enough to see her face. Her eyes are mostly closed, cheeks red, and hair messy. She licks her lips.\"/question null \"#Are you ready for me to untie you?\"/speak Leah \"Yes, then cuddles.\"/message \"You smile, kissing her softly one more time before you start untying her. You rub her wrists and ankles where the ropes were, admiring the way the light rope marks look against her skin.#You help her sit up, and shuffle underneath the blankets. There’s a reusable water bottle on the bedside table and you grab it, helping her drink a little.#Leah smiles sleepily at you and you can’t help but press soft kisses to her forehead, cheeks, and nose. You scoot down and wrap her in your arms.\"/question null \"#How was it? What did you like? Anything you want to do different?\"/speak Leah \"It was perfect. Though, next time, I want you to cum too. Maybe while sitting on my face.\"/message \"You squeeze your thighs together and you groan, burying your face in her neck. She laughs at you quietly and you let out a contented sigh. You can’t wait to see what she’s going to come up with for the exhibit.\"/end",

        //Result 2 - Cuddles!
        "594804R2": "pause 500/speak Leah \"Sure, that sounds really nice! Let me go take care of myself real quick.\"/message \"Leah gives you a pair of pajamas to borrow before she goes to change into her own. When you’re both dressed you shuffle underneath the blankets.#Leah smiles sleepily at you and you can’t help but press soft kisses to her forehead, cheeks, and nose. You scoot down and wrap her in your arms.\"/question \"#What was your favorite part of the show?\"/speak Leah \"I loved the rope artists with the fairy wings. The way the blue fairy’s dark skin contrasted with the rope was stunning.\"/pause 300/message \"You agree and continue to talk until your voices are just murmurs, eyes fluttering shut. You love the warmth of her skin against yours, how safe and loved you feel, from the simple contact. You can’t wait to see what she’s going to come up with for the exhibit.\"/end",

        //Result 3 - Say goodbye
        "594804R3": "pause 50/warp Leah 6 5 1/warp farmer 7 5 3/faceDirection Leah 1/faceDirection farmer 3/viewport 7 7/speak Leah \"Okay! No worries.. I’ll let you know when I’ve figured out exactly what I want to do. Thanks for all your help.\"/emote Leah 20/message \"You give her a hug goodbye.\"/faceDirection farmer 2/move farmer 0 4 2/playSound doorOpen/end"

      }
    },

    //ArchaeologyHouse - tested
    {
      "LogName": "Museum/Library Events",
      "Action": "EditData",
      "Target": "Data/Events/ArchaeologyHouse",
      "Entries": {
        //Penny Library event 594805
        "594805/n MTV_PennyQ1/f Penny 2000/t 1700 2300": "echos/13 9/farmer 8 14 1 Penny 17 5 0 Gunther 3 8 2/skippable/move farmer 3 0 1 /move farmer 0 -2 0/move farmer 3 0 1 /pause 500/emote farmer 8/faceDirection farmer 1/pause 500/faceDirection farmer 3/TextAboveHead Penny \"*moan*\"/pause 500/emote farmer 16/pause 500/move farmer 0 -7 1/move farmer 1 0 1 /pause 300/faceDirection Penny 3/pause 300/message \"Penny quickly pulls her hand out of her skirt and tries to hide a book behind the stool.\"/speak Penny \"Oh, @. I didn't hear...I mean, see you there.\"/quickquestion \"What do you say to Penny?#I heard you making a noise in the shelving#I heard someone moaning#I just wandered over here.(break)emote Penny 60(break)textAboveHead Penny \"Oh no...\"(break)textAboveHead Penny \"Phew\"/speak Penny \"Oh...that. I guess you're wondering what I'm doing over here...#$b#The last time I was here I found a book in the shelves that I hadn't seen before, and I started to read it.#$b#It was a kind of romance novel, but after a couple of chapters it became clear that 'romance' was just a loose metaphor for...#$b#For sex. And other things. To be fair, the book did a good job of describing everything in detail, but I hadn't even heard of most of the things that were described\"/pause 300/emote Penny 60/pause 500/speak Penny \"Not that my mom ever really explained anything to me. Not while sober, anyway.\"/emote farmer 28/speak Penny \"Anyway, the chapter was getting pretty graphic, and I...got carried away and *really* into it.\"/pause 600/quickquestion \"What do you want to ask Penny?#What kind of things did it make you do? #Did it turn you on?#Did you touch yourself?(break)speak Penny \"It didn't really make me do anything. I know it was all me, but I just got sooo wet down there, and before I knew what was happening I was rubbing away, and I moaned, and...you appeared.\"(break)speak Penny \"I guess, though I didn't really get that far into the book yet.\"(break)speak Penny \"I...may have touched myself a little just before you got here.\"/speak Penny \"Anyway, I really want to continue reading this book, but I can't exactly do that here in the library. What if Gunther had found me instead!? Or one of the kids!?#$b#I want to ask you a favour. Could you check out this book for me? I would die of embarrassment if Gunther knew what it was, or if someone else saw me carrying it.\"/question fork1 \"Will you check out the book for Penny?#Of course.#No.\"/fork 594805refused/speak Penny \"Thank you so much, @. Please bring me the book once you have checked it out. You are the best! $h\"/emote farmer 32/fade/viewport -100 -100/addConversationTopic MTV_BoethiaBook 1/addMailReceived MTV_PennyQ1P/end",

        // Initially refused
        "594805refused": "speak Penny \"I'm too ashamed to ask anyone else, @! Please, if you change your mind, bring me the book at home.\"/addQuest 594826/end"
      }
    },

    //Saloon - tested
    {
      "LogName": "Saloon Events",
      "Action": "EditData",
      "Target": "Data/Events/Saloon",
      "Entries": {
        //Haley Saloon event 594806 - Tested
        "594806/n 5948HaleySaloon/f Haley 2000/f Alex 2000/n MTV_Vagina/t 1800 2400": "playful/14 20/farmer 14 23 0 Haley 40 18 1 Gus 14 18 2 Alex 42 18 3/skippable/Speak Gus \"Ah, @. It's going to be a busy night tonight.\"/move farmer 0 -3 0/emote farmer 8/pause 1000/speak Gus \"Haley won some photography contest, and she asked me if she could hold a celebration party here. I'm letting her use the other room for her friends.#$b#Did she send you a letter inviting you?\"/emote farmer 20/pause 800/speak Gus \"She's over by the couches. Let me know what you want to drink, and I'll bring it over when it's ready.\"/pause 300/move farmer 0 1 2/move farmer 3 0 1/fade/viewport -300 -300/warp farmer 31 19 1/pause 800/fade/viewport 38 19/move farmer 4 0 1 true/speak Haley \"...and then they sent sent me a copy of the journal a week early with a letter and the cheque!\"/move farmer 4 0 1 true/faceDirection Haley 3/speak Haley \"Oh hey there @. I'm glad you got my invitation - I was worried that you wouldn't get it in time.#$b#Without that photography session on Marnie's farm I wouldn't even have entered this competition.\"/emote farmer 60/faceDirection Haley 1/speak Alex \"Haley was just saying that they loved her photos in the farmyard, and they're going to post one of them on their website as well.\"/emote farmer 16/speak Haley \"Of course, I didn't send them ALL of the photos. They had a limit of two per photographer, and I wasn't about to show them the photos we took afterwards, cleaning up.\"/jump Alex 8/speak Alex \"You didn't tell me about THOSE, Haley! Do you...still have those photos? I'm just asking because, well...#$b#You're both super hot, and I'd love to see them.\"/emote Alex 60/pause 300/beginSimultaneousCommand/faceDirection Haley 3/faceDirection farmer 1/endSimultaneousCommand/pause 300/speak Haley \"Well, @. What do you think? Should we give Alex a little show?\"/question null \"Fool around with Haley?#Of course\"/fade/viewport -300 -300/message \"Haley checks to make sure the door to the lounge is closed, then winks at Alex and rubs up against you. You can feel her nipples poking into your arm as she leans into your neck and breathes into your ear.\"/speak Haley \"You know, I wonder which one of us is wetter right now, me or you?\"/message \"Haley's hand slips inside your clothing, and starts rubbing your slit through your panties. Your juices quickly soak through, and your legs go weak as Haley nibbles on your ear.#She pauses for a moment, letting you get your breath back, and in one swift moment bends down and pulls your pants to the ground. She quickly removes her skirt, and throws it playfully at Alex.\"/speak Haley \"What do you think, Alex? @ has clearly soaked right through her panties, and mine are pretty much the same.#$b#I can see you're also pitching a tent, so how about we get rid of these pointless clothes and start enojoying ourselves?\"/speak Alex \"You're such a tease, Haley. You're getting @ caught up in your craziness, and the two of you have me harder than a rock.\"/message \"Alex slowly strips down to his underwear and walks over to you, while Haley locks the door. He pulls you in for a deep kiss, and you feel his manhood pressing against your belly.\"/speak Haley \"I may have said that this was a party, but...it's just the three of us. I've been wanting to do this for a long time and I really just needed an excuse.#$b#Alex, I NEED you inside me.\"/message \"Alex looks at you questioningly, and you nod to let him know that it's ok. Haley has already removed her panties, sat down on the couch, and is spreading her legs for him.#With a hungry look on both of their faces, Alex removes his underwear, freeing his prick which points skyhigh. Haley spreads her lips for Alex and helps him slide inside her, resting for a moment when he bottoms out.\"/speak Haley \"Ooh, I feel so full, Alex. Pound me hard, ok?\"/message \"Alex starts jackhammering away at Haley's dripping wet pussy, and you sit down on the couch next to them and watch for a while, fingering yourself. Haley is struggling to stifle her moans so you lean over and kiss her, your fingers buried to the hilt inside you, and Alex balls deep in Haley.\"/speak Haley \"Alex, I think @ is going to feel left out soon. Lets switch it up so I can eat her out.\"/message \"You lay down on one end of the couch while Alex and Haley shuffle around, ending with Haley's face buried in your cunt, and Alex's dick still embedded in hers.\"/pause 300/playSound fishSlap/pause 300/playSound fishSlap/pause 300/playSound fishSlap/message \"Haley's tongue is magical, and she licks and nibbles every part of your special area like a pro. Alternating between burying her tongue inside you, wiggling it to stimulate the sides of your hole, and flicking and sucking on your clit, she brings you right to the edge of orgasm.\"/speak Alex \"I'm going to cum!$a\"/speak Haley \"Me too! Make sure you cover me and @!\"/message \"Alex quickly pulls out and sprays a jet of cum over Haleys back, and onto your chest, coating you in his seed. Haley sucks hard on your clit, causing a waterfall of pleasure to wash over you, and quickly stuffs three fingers inside her gaping hole as she cums with you.#All of you lay on the couch, exhausted. Alex's cock slowly softens as you shake in bliss, and Haley just rests her face between your legs.\"/pause 500/speak Haley \"Wow...that was awesome. We TOTALLY have to do that again sometime. Maybe next time I can bring some toys and we can fill you front and back, @?\"/pause 500/message \"The three of you use some napkins to try and clean up a bit, then spend the rest of the evening drinking and joking about the future.\"/end dialogue Haley \"Wow, that was exhausting!\""
      }
    },

    //ScienceHouse - tested
    {
      "LogName": "Mountain House Events",
      "Action": "EditData",
      "Target": "Data/Events/ScienceHouse",
      "Entries": {
        // Maru - Route A
        "594808/f Maru 2000/n MTV_Vagina/n MTV_MaruQ4/p Maru/t 1800 2400": "echos/7 6/farmer 11 12 0 Maru 7 6 1 Demetrius 20 12 3/skippable/move farmer -4 0 3/move farmer 0 -1 0/emote farmer 8/jump Maru 8/speak Maru \"I'll just be one moment, @.\"/faceDirection Maru 1/faceDirection Maru 3/emote Maru 52/pause 500/faceDirection farmer 1/pause 300/faceDirection farmer 3/pause 300/faceDirection farmer 0/move Maru 0 3 2/doAction 7 10/speak Maru \"Sorry I kept you, I've been...busy. I must look a real mess.\"/emote farmer 28/speak Maru \"I see you got my letter. It's not something I can ask anyone else to help me with, and it's...embarassing. Hey, can you come inside so I can show you what I've been working on?\"/emote farmer 32/move Maru 0 -2 0/move farmer 0 -2 0/faceDirection farmer 2/doAction 7 10/pause 800/move Maru -1 0 3/move farmer 0 -2 0/faceDirection Maru 1/faceDirection farmer 3/message \"Maru walks into the middle of the room, looking fidgety and embarrassed.\"/speak Maru \"So, I've been working on another invention, and it's going pretty well, but...pretty well isn't good enough.\"/question null \"#I'm sure anything you're working on is great. Maybe I can provide another perspective?\"/emote Maru 32/pause 300/speak Maru \"I think that is a great idea, but please don't judge me, ok?\"/emote farmer 8/speak Maru \"I've been really struggling with my...desires...lately, and I thought that by working on a machine I'd be able to get everything under control.#$b#And get off easier as well.\"/emote farmer 20/pause 500/speak Maru \"Even thought it's very good at getting me in the mood at the beginning, it just feels too...clinical.\"/question fork1 \"What do you want to say to Maru?#Maybe I can try and help you work out what you like?#Maybe I can try out the machine and give you some feedback?\"/fork 594808machine/emote Maru 8/pause 500/speak Maru \"I'm willing to give it a try if you are. Maybe between the two of us we can work out what turns me on the most?#I have one condition though, that you use the attachments I have for my invention. It's going to be hard enough without trying to reinvent fingers...or a tongue.\"/message \"Maru turns around and starts unbuttoning her overalls, undoing the front flap and stepping out of them. You take a moment to admire her plump ass as she bends over and removes her shorts, with her shirt swiftly following, revealing her bare back.\"/speak Maru \"I...don't like to wear a bra if I don't have to. They're so uncomfortable, and if I'm not leaving the house I don't see the point.\"/question null \"Do you...think I look ok?#You look beautiful.\"/emote Maru 60/speak Maru \"You have this, Maru.$h#$b#Thank you, @. I'm not very confident about my body, and you always make me feel so safe and wonderful. I know I can trust you.\"/move Demetrius -13 0 3/move Demetrius 0 -1 0/speak Demetrius \"Is everything ok in there, honey? I think I heard someone come in earlier.\"/emote Maru 16/move Maru 0 1 2/faceDirection Maru 1/faceDirection farmer 2/pause 300/speak Maru \"Yeah, dad. Everything is fine. @ came over to help me with a project, so we may be a while.\"/emote Maru 60/speak Demetrius \"Let me know if you need a hand with anything, ok?\"/speak Maru \"Ok Dad. Are you feeling left out because I have a new helper? I promise that you aren't being replaced...completely.\"/emote Demetrius 16/speak Demetrius \"Ouch. Ok honey. Don't forget to eat and stay hydrated, ok?\"/move Demetrius 0 1 2/move Demetrius 5 0 2 true/speak Maru \"Of course my dad would choose that moment to make an appearance. I think we'd better find somewhere more private to continue this.#I guess we'd better head into the lab? I have everything down there and I REALLY don't want my dad to start asking questions through the door again.\"/emote farmer 60/fade/viewport -300 -300/message \"Maru unlocks the door to her lab in the basement.\"/speak Maru \"Hey there, @. Won't you step into my lab? I have *all* sorts of wonderful things to show you.$h.\"/message \"As she starts climbing down the ladder, she flashes you a nervous, but slightly coy smile.\"/pause 300/speak Maru \"I'm sorry about the mess. When I'm in the middle of things I tend to accumulate a lot of stuff. Anyway, I plan on making the area a lot messier before we're done.$h.\"/message \"As you enter the lab, you see that Maru wasn't exagerating. There are various half finished projects strewn around the room, and the workbench is covered in wires and electrical components.\"/message \"There is a bottle of lube sitting beside a stool, and Maru walks past it to the workbench. After a couple of minutes moving items around she stands, triumphant and naked, having picked up several items for you.\"/speak Maru \"See? I made it all modular so that I can try different things and see what works the best. I plan on upgrading some of them in the future.\"/message \"Maru stands before you, completely naked and holding a dildo in one hand, and a couple of small objects shaped like neko cat faces, all connected by wires.# She sees you staring at them and clumsily uses her other hand to press a button, making them vibrate.\"/speak Maru \"They had a sale on these...and I spent too much money on the servos.$s\" /message \"Maru quickly makes some space on the workbench, wipes the worst of the oil up with a rag, lays down a blanket and hops up on top, her knees dangling over the edge.#She props herself up on her elbows and looks at you coyly.\" /speak Maru \"So, I usually start off with the little vibrators between my legs, but I kind of struggle to get going from there.#$b#The sensations are nice, but I just end up feeling a little turned on without any real desire or anything.#$b#I kind of get a little wet pretty quickly, but I end up drying up after a while and then have to stop to apply lube...and it just ends up being pretty unfulfilling, even when I use the big boy there.\"/message \"You have a pretty good idea where she is going wrong, so you ask her to lie down, close her eyes, and focus on the sensations. You start off by gently rubbing her breasts to get some feeling in them, and then turn on the little vibes and trace them around her breasts slowly.#Her nipples responds quickly, and you bring the vibes closer and closer to them, causing Maru to start breathing heavier. You firmly hold them against her nipples, and her breath catches in her throat.#Taking this as a good sign, you keep one hand there with a vibe, and use the other to start tracing patterns on the inside of her thigh. You make a path up the inside of her thigh, rubbing it up the outside of her labia, and then move to the other side and repeat.\"/speak Maru \"I see what you're doing there, trying to increase my focus on other parts of my body to turn me on first.#$b#I'm sure that I can do something so that it circles around my breasts, or up my thighs, but...\"/message \"You continue your path up her thigh, and this time end up sliding the vibe between her wet lips, pressing it lightly against her opening. She breaks off mid-sentence, clearly caught out, and her mouth lets out a low moan of pleasure.#You slowly start moving it around her lips, touching lightly against her clit (which causes her to arch her back) and then back down to her opening to press slightly inside her. You do this several times, noticing just how wet she is getting, and also how close.\"/message \"As Maru starts panting, you remove the vibe from her lips and move it back up to her breasts, keeping some stimulation but denying her release.\"/speak Maru \"What are you doing? I was almost there!$a\"/message \"You smile down at her, completely helpless before you, and remind her that the goal is not just to get her off, but to give her ideas for the future. Edging can help bring her more enjoyable orgasms, and is something that she might be able to do with the machines.#Maru pouts at you, but can't really do anything right now. After a moment you see she has come back from the edge, and you pick up the dildo that she grabbed earlier, applying some lube. You rub it between your hands a few times to warm it up, then bring it to her entrance and start gently nudging it with the tip.#It isn't long before her hips are bucking against the dildo, trying to get it inside her, so you oblige by slowly sliding it inside, her juices and the lube helping it to slip deeply inside. You bring it back out again, clearly slower than Maru wants, but her juices are starting to pool on the blanket, showing just how good it must feel.\"/speak Maru \"I'm getting really close again, @. That vibrator feels so good!\"/message \"You hadn't noticed before, but you can see a button on the bottom of the 'vibrator'. You pause for a moment to switch it on, and Maru almost bucks off the bench from the shock. The orgasm that had been building crashes into her as you plunge the vibrator fully inside her, and start pumping away.\"/speak Maru \"@....I'm cumming!$h\"/pause 800/speak Maru \"That was amazing, @. I never would have considered focussing on my breasts first.#$b#I guess I was thinking too hard about one part of my body, when I have sensation in all of it. And warming up the lube first stopped it from distracting me.#$b#I was a little annoyed that you didn't warn me you were going to keep me on the edge, but...it did feel amazing when I finally came.#$b#I'm sure I can rig something up in software to stop me from cumming right away, but I'll probably try and get around it the first few times.#$b#I guess there's no substitution for a 'helping hand' though. You were amazing. Let me get cleaned up and we can head back upstairs. I'd hate for my dad to see me naked, covered in oil, and my juices dripping down my leg. I'm not ready to have THAT talk with him.$l.\"/end",

        // Route B fork - Machine Sex
        "594808machine": "emote Maru 8/pause 500/speak Maru \"I'm willing to give it a try if you are. Maybe you'll have some insights afterwards, or be able to suggest something for me to try. And of course, I'll get to see your sexy body getting fucked by my invention.#$b#Erm...I hope you don't mind, but this is probably the most erotic thing I've thought about. Making a machine and having it fuck you while I watch? I'm getting hot already.\"/message \"Maru turns around and starts unbuttoning her overalls, undoing the front flap and stepping out of them. You take a moment to admire her plump ass as she bends over and removes her shorts, with her shirt swiftly following, revealing her bare back.\"/speak Maru \"I...don't like to wear a bra if I don't have to. They're so uncomfortable, and if I'm not leaving the house I don't see the point.\"/question null \"Do you...think I look ok?#You look beautiful\"/emote Maru 60/speak Maru \"You have this, Maru.$h#$b#Thank you, @. I'm not very confident about my body, and you always make me feel so safe and wonderful. I know I can trust you.\"/move Demetrius -13 0 3/move Demetrius 0 -1 0/speak Demetrius \"Is everything ok in there, honey? I think I heard someone come in earlier.\"/emote Maru 16/move Maru 0 1 2/faceDirection Maru 1/faceDirection farmer 2/pause 300/speak Maru \"Yeah, dad. Everything is fine. @ came over to help me with a project, so we may be a while.\"/emote Maru 60/speak Demetrius \"Let me know if you need a hand with anything, ok?\"/speak Maru \"Ok Dad. Are you feeling left out because I have a new helper? I promise that you aren't being replaced...completely.\"/emote Demetrius 16/speak Demetrius \"Ouch. Ok honey. Don't forget to eat and stay hydrated, ok?\"/move Demetrius 0 1 2/move Demetrius 5 0 2/speak Maru \"Of course my dad would choose that moment to make an appearance. I think we'd better find somewhere more private to continue this.#I guess we'd better head into the lab? I have everything down there and I REALLY don't want my dad to start asking questions through the door again.\"/emote farmer 60/fade/viewport -300 -300/message \"Maru unlocks the door to her lab in the basement.\"/speak Maru \"Hey there, @. Won't you step into my lab? I have *all* sorts of wonderful things to show you.$h.\"/message \"As she starts climbing down the ladder, she flashes you a nervous, but slightly coy smile.\"/pause 300/speak Maru \"I'm sorry about the mess. When I'm in the middle of things I tend to accumulate a lot of stuff. Anyway, I plan on making the area a lot messier before we're done.$h.\"/message \"As you enter the lab, you see that Maru wasn't exagerating. There are various half finished projects strewn around the room, and the workbench is covered in wires and electrical components.\"/message \"There is a bottle of lube sitting beside a stool, and Maru walks past it to the workbench.\"/speak Maru \"See? I made it all modular so that I can try different things and see what works the best. I plan on upgrading some of them in the future.\"/message \"Maru quickly clears off the workbench, wipes the worst of the oil up with a rag, and cleans it up as best as she can, laying down a blanket. She helps you up on to the table, then fetches a bundle of wires and servos, as well as some rather cute looking sex toys..\"/speak Maru \"They had a sale on these...and I spent too much money on the servos. Here, let me set everything up.#$b#In my fantasies I would have tied you to the table like a mad scientist, but I don't have anything like that ready...$s\"/message \"Maru sets up a rather small looking machine at the end of the workbench that looks suspiciously like a prototype of a robot, except for a piston protuding from the crotch. A purple dildo is attached the end, along with a spring mechanism to reduce the force, and cute little ears are painted on it.\"/speak Maru \"I have 'Henry' all set up, and I usually start off by holding one of the the little vibrators between my legs, and the other on my breasts.#$b#I guess I'm rambling a bit, so I should probably just start everything off.\"/message \"You close your eyes and wait for Maru and 'Henry' to begin. You hear a small buzzing sound, and Maru's hand presses one of the small vibrators against your breast, circling your nipple slowly.\"/message \"Your nipple responds quickly, hardening and standing erect, and she brings the vibe closer and closer to it. Your breathing gets heavier, and your breath catches in your throat when Maru brings it to rest right on the tip.#Taking this as a good sign, she keeps one hand there with the vibe, and uses the other to start tracing patterns on the inside of your thigh. She makes a path up the inside of your thigh, rubbing it up the outside of your labia, and then moves to the other side.\"/speak Maru \"Your breasts are perfect, @. I just want to suck on your nipples and make you cry out, but that will have to wait for another time.\"/message \"You flinch a little as Maru places the other vibrator on your mound, and starts inching it downwards towards your sensitive place. It wanders slowly, never in a straight line, and teases you as it gets closer and closer to your nether lips.#You can feel your juices running, and Maru slides the vibe down your slit, coating it heavily in your juices, and then pushes it firmly against your opening, causing you to buck off of the table.#Her hands leaves your breast, and Maru starts moving the vibrator up and down your pussy, making you jump every time it bumps against your clitoris, and moan every time she presses it slightly into your vagina. You feel your orgasm getting closer, and she suddenly removes that hand from you as well, leaving you unable to climax.\"/speak Maru \"I'm sorry honey, but if you cum too soon I won't get much out of this experiment. Also, that was just the warm up to get you ready for Henry.\"/message \"You pout at Maru, but you can't really do anything right now. After a moment of fiddling with her machine, you feel the dildo poking gently at your entrance, and Maru spreads your lips and inserts it slowly inside you as deep as it can go.#She backs it off a little, and adjusts 'Henry' a little.\"/speak Maru \"Seems like you can take him a little deeper than me right now, but I've adjusted him for that.#$b#I don't think it will be long before I can take him that deep as well, and I have been thinking about getting a larger attachment for him.$h\"/message \"Maru flicks a switch, and the machine starts sliding in and out of you, building speed slowly. It isn't long before your hips are bucking against the dildo in time with it's thrusts, and you look over to see that Maru has her fingers deep inside her snatch as she watches you get pounded.\"/speak Maru \"I hope it feels good for you, @. Watching your cunt take 'Henry's' dildo and stretch around it is the hottest thing I've seen.#$b#I wish I could record this and play it back when he's fucking me too. Here, let me turn on the last function.\"/message \"There's a brief pause, and then the 'dildo' attachment starts vibrating as well with a buzzing noise much louder than it's little siblings earlier. Your eyes roll back into your head at this extra stimulation, and you hear Maru shout out in pleasure as she squirts her cream all over her hand. Her legs are unsteady, but she leans against the workbench and kisses you deeply as your orgasm finally washes over you.\"/pause 800/speak Maru \"That was amazing, @. Here, let me turn off 'Henry' and I'll clean you up. I've never cum as hard in my life, and I'm starting to think that the machine is only part of it. Being here with you was wonderful, and I think that's a big part of what I've been missing.$l\"/message \"After Maru helps wipe you clean (with a fresh cloth) she starts asking you questions and taking notes about which bits you enjoyed the most. After a while you both get dressed and head back upstairs.\"/end"

        // Farmer taking up Maru on the option of providing milk directly - not written
      }
    },

    //Haley/Emily House - tested
    {
      "LogName": "HaleyHouse Events",
      "Action": "EditData",
      "Target": "Data/Events/HaleyHouse",
      "Entries": {
        // Emily clothing model/groping event 594809 complete?
        "594809/f Emily 1500/n MTV_EmilyQ2/p Emily": "playful/14 6/farmer 16 10 0 Emily 14 5 0/skippable/emote Emily 56/textAboveHead Emily \"Hum dee hum\"/pause 500/move farmer 0 -2 0/move farmer -2 0 3/move farmer 0 -2 0/faceDirection Emily 2/emote Emily 32/textAboveHead Emily \"Almost done\"/pause 300/emote farmer 16/pause 500/speak Emily \"There we go! It took a lot of work, but I think its ready. I'm really excited to see how it looks on a real person.\"/question null \"#What is it?\"/speak Emily \"Well, I got a commission for a ball gown, and they sent me some sketches of what they want it to look like, along with their measurements.#$b#I hope you don't mind, but I think you're actually the same size as the client.\"/emote farmer 8/pause 300/emote Emily 16/emote farmer 60/pause 400/speak Emily \"Oh, I hope you don't think I'm creepy. It's just very difficult to find models outside of Zuzu City.#$b#So I often ask Robin, Jodi and Caroline to model dresses for me, depending on what size I need to make it.#$b#Here, let me just double check your waist and bust to make sure it's going to fit.\"/message \"Emily doesn't wait for you to respond, and has her tailors tape around your waist before you can protest. She clucks her tongue as she writes down your measurements on a notepad, and then quickly checks your chest size in a very professional manner.\"/emote farmer 16/speak Emily \"Oh, don't worry. I don't tell anyone about the measurements I take, and bodies come in all shapes and sizes.#$b#Don't let the magazines tell you that everyone needs to be the same size to be beautiful!\"/emote farmer 32/pause 300/message \"Emily checks her notes for the dress against yours, and seems happy.\"/speak Emily \"Just right. You're an inch or so thinner around the chest, but you have an extra couple of inches on the waist.#$b#Don't pout, I actually think you have a better body shape, and you work on the farm so it's to be expected.\"/fade/viewport -100 -100/message \"Emily removes the dress from her sewing machine, while you strip out of your outerwear, and hands it to you. She helps you step into it, and after a few minutes of wriggling and making sure the seams aren't going to pop, you are ready for her to zip you up.\"/speak Emily \"Oh wow, it looks so good on you! It really catches the light and accentuates your curves! Can you move around and walk in it fine?#$b#Wow, your ass looks so good in it! Here, it looks like it was hitching up a little.#$b#That won't be an issue with the right underwear, but I understand not wearing lingerie while farming. Here, let me smooth it out for you.\"/message \"Emily walks behind you and starts smoothing down your rump. She seems to get a distracted after a moment, and she gives your ass a couple of squeezes, causing you to yelp.\"/speak Emily \"Oh! I'm so sorry, @. You just look so good in the dress, and I get a little caught up in my head sometimes.#$b#I have to admit, I've been working non-stop on this dress for a while, and staring at reference pictures all day can get me a little...distracted.\"/emote Emily 32/emote farmer 32/pause 200/speak Emily \"Here, let me help you out of the dress, I don't think you can reach the zipper yourself. I have a couple of things to finish off and then I can ship it off to the client tomorrow.\"/fade/viewport -300 -300/message \"Emily walks around behind you and starts unzipping the dress. She helps slide it down around your waist, and kneels down behind you to pick up the dress as your step out of it. After a moment you realise she is still behind you, and feel her hand gently rest against your behind.\"/speak Emily \"You really do have such an attractive body, @. I promise I didn't ask you to do this just so I could see you in your underwear.#$b#If you ever wanted me to design you something sexier I would love to.\"/message \"You smile at Emily as she straights up and places the dress on her work table, then turn around and pose for her.#Emily walks over and wraps her arms around you, pulling you in close. Her body is pressed tightly against yours, and she lean into you, resting her head on your shoulder.\"/speak Emily \"I would love to lose myself with you right now, but you'd be suprised how tiring sitting at a sewing machine can be.\"/mail MTV_EmilyQ1T/quickquestion \"What would you like to do?#Give her a relaxing massage#Offer to help her work out her sexual frustrations(break)switchevent 594809boring(break)switchevent 594809Sexytime/end",

        // Boring choice
        "594809boring": "pause 50/speak Emily \"Oh, @. That would be wonderful. Here, give me a moment to take off my shirt and pants. There's some oil in the dresser over there.\"/message \"Emily quickly disrobes and lies on her bed, face down, quickly settling. Her body doesn't seem to be very relaxed, but you warm up the oil on your hands and start gently running your hands over her back. Her skin is soon glistening, and she is soon gently moaning into her pillow.\"/speak Emily \"Oh, @. That feels heavenly. Most of my tension is in my shoulders and lower back.\"/message \"You start rubbing her shoulders a little more intently, creating circles and spirals on her back that quickly fade from view. Her body is soon much more relaxed on the bed, and her moans and sighs of appreciation start getting quieter.\"/speak Emily \"@, if you keep this up then I'm going to fall asleep. As wonderful as this is we should probably stop so I can finish up the dress.#$b#Perhaps you can come back later after I've finished up and I can show you my appreciation?\"/addConversationTopic get_eaten 4/addMailReceived MTV_EmilyQ2P/end",

        // sexytime fork!
        "594809Sexytime": "pause 50/speak Emily \"Oh! I wasn't touching you because I wanted to have sex with you, I just get distracted when I'm tired.#$b#It's not that I wouldn't love to, I just don't want to take advantage of you.\"/question null \"#It's ok, I want this too.\"/speak Emily \"Let's get a bit more comfortable then. I feel like I'm overdressed for this now.\"/message \"Emily removes her pants and top, her tired back clearly slowing her down. When she gets down to her underwear, you help her unclasp her bra, and sit her down on her bed so you can remove her panties.#She leans back on the bed, so you start trailing kisses up her legs, pausing when you reach the top of her thigh.#You hook your fingers in her underwear and slowly pull them down, taking the last of her reserve with them.\"/speak Emily \"Come join me on the bed, @. I don't have a lot of strength left, but I would love to be intimate with you.\"/message \"You quickly shed the last of your clothing and join Emily on the bed, cuddling against her naked body and gently stroking her skin.#Emily sighs contentedly, and you start gently cupping and squeezing her breasts, watching her face to see her reactions.#Before long you see that Emily's breath is getting shorter, and you take that as your cue to start gently brushing her nipples with your finger tips, squeezing them slightly, and eventually taking one of her nipples into your mouth and suckling.\"/speak Emily \"Don't get too rough with me today, @, I need some tender loving today.\"/question null \"#Ok, gentle, tender loving today.\"/message \"You suck on her nipple a couple more time, the sweet taste of her milk wetting your appetite, and reminding you that there are other juicey places to explore.#You shimmy down the bed and seat yourself between her legs, knees bent to create space for you. You grab her slim butt and use it to hold yourself in place as you start planting kisses around her inner thighs.#Not wanting to rush this, and knowing that she needs relaxing just as much as she needs an orgasm, you take your time making sure every spot of skin is loved, and then move inwards, building the suspense and arousal.#The slight trickle of juices from when you started has now become a river snaking its way between Emily's lips. You place your tongue at the bottom of her slit and take one long, slow lick all the way up.\"/speak Emily \"oooooohhhhhh!\"/message \"You can feel Emily fighting not to close her legs right now, and her pussy is trembling as you reach the top, your tongue gently touching her clit momentarily.#You sneak a glance upwards and see Emily blissfully gazing at the ceiling, a content look upon her face.\"/question null \"#Want me to keep going?\"/speak Emily \"Please, @. I didn't realise how much I needed this until you started kissing me down there.\"/message \"You start gently kneeding Emily's ass before going back to work licking all the juices from around her outer labia, and then taking slow deliberate licks between them.#The flow isn't stopping any time soon, but you start tongueing her opening directly, probing the edge of it and then pushing your tongue in and wiggling it to stimulate her.#The slow build at the beginning, and her overdue orgasm, soon has Emily's hips bucking as your tongue delves deep inside.\"/speak Emily \"I'm getting close, @ !\"/message \"You try and push as much of your tongue into Emily as you can as she goes over the edge. #Her hips close around your head in ecstasy and everything goes dark. You find her clit and start flicking it with your tongue, causing Emily to cry out loudly as she gushes.#You ride out her orgasm until she collapses back on the bed, letting you see and breathe once more.\"/speak Emily \"That was amazing @, but I don't think I have any energy to do anything else today now. I'll have to pack up the dress later, but it was definitely worth it. Thank you.$l\"/addMailReceived MTV_EmilyQ2P/end"
      }
    },

    //Railroad/bathhouse - tested
    {
      "LogName": "Railroad/bathhouse event",
      "Action": "EditData",
      "Target": "Data/Events/Railroad",
      "Entries": {

        // Watching Penny with Alex and Leah - Ace version
        //"594812/f Alex 2000/f Leah 2000/n MTV_Ace/n MTV_PennyQ2/t 1900 2200":
        "594812/f Alex 2000/f Leah 2000/n MTV_Ace/n MTV_PennyQ2/t 1900 2200": "nightTime/10 55/farmer 14 58 3 Leah 5 51 1 Alex 5 52 1 Penny 15 38 0/skippable/move farmer -4 0 3/playsound leafrustle/textAboveHead Leah \"*giggle*\"/emote farmer 8/pause 300/move farmer 0 -1 0/move farmer -1 0 3/fade/warp farmer 2 51 1/move farmer 1 0 1/beginSimultaneousCommand/faceDirection Alex 0/faceDirection Leah 2/endSimultaneousCommand/beginSimultaneousCommand/textAboveHead Leah \"We've been rumbled\"/textAboveHead Alex \"Uh-oh\"/endSimultaneousCommand/beginSimultaneousCommand/faceDirection Alex 3/faceDirection Leah 3/endSimultaneousCommand/pause 300/question \"#What are you two doing?\"/speak Leah \"Err, this isn't what it looks like.\"/speak Alex \"Yep, we definitely weren't in the bushes.\"/emote farmer 8/pause 300/speak Alex \"Can you keep a secret? we don't want to hurt anyone.\"/textabovehead farmer \"Yes\"/speak Leah \"We noticed something has been going on with Penny, and we followed her. Well, I guess it's more accurate to say that we've been watching her as well.\"/speak Alex \"She has been in the bathhouse quite a lot, and so we thought maybe she was meeting someone up here. My money was on you, but I guess I was wrong.\"/textabovehead Leah \"this time...\"/pause 300/emote farmer 60/pause 300/speak Leah \"Anyway, Penny has been coming up here a few nights a week, and I caught Alex up here watching through the windows.\"/faceDirection Alex 0/speak Alex \"You were looking too!\"/emote farmer 4/speak Leah \"Don't try to tell me you don't think Penny is hiding a sexy body under those conservative clothes!\"/speak Leah \"Anyway, I thought she was being super boring, reading a book in there. Ooh! she's getting into the bathing area. Quick!\"/faceDirection Leah 1/faceDirection Alex 1/fade/viewport -100 -100/message \"Penny enters the bathing area with a towel on, and a book under her arm.#You see her sit on one of the chairs and get comfortable. She has a quick look around to make sure that no-one is watching, and then picks up her book.\"/speak Leah \"This is when it gets good. Watch what she does with her towel. I almost missed it the first time.\"/message \"After a couple of minutes reading you see Penny put her book down on the table beside her, and adjust her towel, revealing her bare legs.#She picks the book up again with one hand and you see her other one slip beneath her towel, gently massaging her breast.#You hear Alex and Leah rustling behind you, and turn back to see that Alex has his pants off and Leah is gently licking the tip of his cock.#A quick glance back inside the bathhouse lets you see that Penny is planning on taking her time, her hand still slowly squeezing her breast, though you can see that her breathing is getting heavier.\"/speak Leah \"*slurp* I lied a little earlier, when I told you I didn't know what was up with Penny.#$b#I got a mysterious letter, and Maru has seen Penny coming up here more than usual, so I thought it might be her.#$b#I think it's one of her fantasies to have people watch her masturbate, so she must have sent the letter to us anonymously.\"/speak Leah \"Of course, right now she doesn't know for certain that we're out here, but I think the IDEA of being watched is what's most important to her.\"/message \"Leah goes back to sucking off Alex, who is more than happy to be on the receiving end of Leah's blowjob. His hand is on the back of her head, and you can hear him whispering words of encouragement to her.#You look back inside the bath house, and can see that Penny's towel is on the floor, and she is entirely focussed on fingering herself, the book forgotten at this point.#From this angle you can see that she has two fingers buried inside her pussy, and you can only imagine the wet sounds that must be echoing in there, feeding her desires.#Alex grunts in satisfaction, and you glance back to see Leah taking him deeply down her throat. The sound of her swallowing lets you know that Alex has finished, and Leah's moans let you know that she's not far behind either.\"/speak Leah \"Wow, that was something else. I can see why Penny likes having someone watching. How about you, Alex?\"/speak Alex \"Give me a moment, Leah. You literally sucked the life out of my balls.\"/pause 700/speak Alex \"Wow, my legs are all tired like when I used to play gridball.#$b#I guess I came harder than I normally do, but I think that's only because it was you and @.#$b#I'm more of a do-er than a watch-er, and I don't think I'd be into this if it was anyone else.\"/question \"#Would you want to do it like this again, guys?\"/message \"Leah and Alex look at each other for a moment, than back at you, grins on their faces.\"/speak Leah \"I think that both of us are up for it. We'd love you to join in, but would never want to pressure you into something that makes you uncomfortable.\"/speak Alex \"I hope I didn't make you feel uncomfortable with my comment about 'doing rather than watching'.#$b#If you want to join us again, just come by. I don't think Penny had her fill yet either.\"/pause 300/message \"Maybe I can speak to Penny about this next time I'm with her.\"/addConversationTopic MTV_BathhouseFun 2/addMailReceived MTV_PennyQ2T/end",


        // Watching Penny with Alex and Leah - repeatable Ace version
        //"5948121/e 594812/f Alex 2000/f Leah 2000/n MTV_Ace/n MTV_PennyQ2T/t 1900 2200": "nightTime/10 55/farmer 14 58 3 Leah 5 51 1 Alex 5 52 1 Penny 15 38 0/skippable/move farmer -4 0 3/playsound leafrustle/textAboveHead Leah \"*giggle*\"/emote farmer 8/quickquestion \"Do you want to go join Alex and Leah, or check in on Penny?#Join Alex and Leah#Go visit Penny inside(break)move farmer -1 0 3(break)switchevent 594812r/pause 300/move farmer 0 -1 0/move farmer -1 0 3/fade/warp farmer 2 51 1/move farmer 1 0 1/beginSimultaneousCommand/faceDirection Alex 3/faceDirection Leah 3/endSimultaneousCommand/pause 300/question \"#Back at it again?\"/speak Leah \"I'm glad you could join us, @.\"/speak Alex \"Yep, Penny is in the mood, and so are we.\"/emote farmer 20/pause 300/speak Leah \"Ooh! she's getting into the bathing area. quick!\"/faceDirection Leah 1/faceDirection Alex 1/fade/viewport -100 -100/message \"Penny enters the bathing area with a towel on, and a book under her arm.#You see her sit on one of the chairs and get comfortable. She has a quick look around to make sure that no-one is watching, and then picks up her book.\"/speak Leah \"This is when it gets good. Watch what she does with her towel. I almost missed it the first time.\"/message \"After a couple of minutes reading you see Penny put her book down on the table beside her, and adjust her towel, revealing her bare legs.#She picks the book up again with one hand and you see her other one slip beneath her towel, gently massaging her breast.#You hear Alex and Leah rustling behind you, and turn back to see that Alex has his pants off and Leah is gently licking the tip of his cock.#Alex is more than happy to be on the receiving end of Leah's blowjob. His hand is on the back of her head, and you can hear him whispering words of encouragement to her.#A quick glance inside the bathhouse lets you know that Penny is planning on taking her time, her hand still slowly squeezing her breast, though you can see that her breathing is getting heavier.#Penny completely removes her towel and drops it on the floor beside her chair, focussed entirely on fingering herself.#Her breathing must be pretty heavy by now, and from the look on her face she is reliving the fantasy of whatever she just read.#From this angle you can see that she has two fingers buried inside her pussy, and you can only imagine the wet sounds that must be echoing in there, feeding her desires.#Alex grunts in satisfaction, and you glance back to see Leah taking him deeply down her throat. The sound of her swallowing lets you know that Alex has finished, and Leah's moans let you know that she's not far behind either.\"/speak Leah \"Wow, that was something else. I can see why Penny likes having someone watching. How are you doing, Alex?\"/speak Alex \"Give me a moment, Leah. You literally sucked the life out of my balls.\"/pause 700/speak Alex \"Wow, my legs are all weak, just like when I used to play gridball in high school. You are definitely the best as giving head, Leah\"/pause 300/message \"Maybe next time I can go into the bath house with Penny.\"/addConversationTopic MTV_BathhouseFun 1/end",

        // Going into bath house with Penny - Ace version
        "594812r": "fade/viewport -100 -100 /message \"You enter the sauna, eager to see whether Penny is waiting for you inside. After quickly getting changed, and wrapping yourself in a towel, you head with trepidation into the bathing area.#The atmosphere is thick, and the rhythmic sound of the water, along with the light by the slight waves, lends a slightly alien feel to the room.#You can hear other, more erotic sounds as well.\"/playsound fishSlap/pause 300/playsound fishSlap/pause 300/speak Penny \"ooohhhh...just like that. But what if someone catches us...?\"/message \"Penny is lost in her own world, one recreated from the romance novel she has been reading.#You quietly make your way closer, careful not to startle her, and find lounge chair not too far away.\"/speak Penny \"No...I don't want people to watch. *shiver*\"/message \"\"/end",

        // Watching Penny with Alex and Leah - Vagina version
        "594813/f Alex 2000/f Leah 2000/n MTV_Vagina/n MTV_PennyQ2/t 1900 2200": "nightTime/10 55/farmer 14 58 3 Leah 5 51 1 Alex 5 52 1 Penny 15 38 0/skippable/move farmer -4 0 3/playsound leafrustle/textAboveHead Leah \"*giggle*\"/emote farmer 8/pause 300/move farmer 0 -1 0/move farmer -1 0 3/fade/warp farmer 2 51 1/move farmer 1 0 1/beginSimultaneousCommand/faceDirection Alex 0/faceDirection Leah 2/endSimultaneousCommand/beginSimultaneousCommand/textAboveHead Leah \"We've been rumbled\"/textAboveHead Alex \"Uh-oh\"/endSimultaneousCommand/beginSimultaneousCommand/faceDirection Alex 3/faceDirection Leah 3/endSimultaneousCommand/pause 300/question \"#What are you two doing?\"/speak Leah \"Err, this isn't what it looks like.\"/speak Alex \"Yep, we definitely weren't in the bushes.\"/emote farmer 8/pause 300/speak Alex \"Can you keep a secret? we don't want to hurt anyone.\"/textabovehead farmer \"Yes\"/speak Leah \"We noticed something has been going on with Penny, and we followed her. Well, I guess it's more accurate to say that we've been watching her as well.\"/speak Alex \"She has been in the bathhouse quite a lot, and so we thought maybe she was meeting someone up here. My money was on you, but I guess I was wrong.\"/textabovehead Leah \"this time...\"/pause 300/emote farmer 60/pause 300/speak Leah \"Anyway, Penny has been coming up here a few nights a week, and I caught Alex up here watching through the windows.\"/speak Alex \"You were looking too!\"/emote farmer 4/speak Leah \"Don't try to tell me you don't think Penny is hiding a sexy body under those schoolteacher clothes!\"/speak Leah \"Anyway, I thought she was being super boring, reading a book in there. Ooh! she's getting into the bathing area. quick!\"/faceDirection Leah 1/faceDirection Alex 1/fade/viewport -100 -100/message \"Penny enters the bathing area with a towel on, and a book under her arm.#You see her sit on one of the chairs and get comfortable. She has a quick look around to make sure that no-one is watching, and then picks up her book.\"/speak Leah \"This is when it gets good. Watch what she does with her towel. I almost missed it the first time.\"/message \"After a couple of minutes reading you see Penny put her book down on the table beside her, and adjust her towel, revealing her bare legs.#She picks the book up again with one hand and you see her other one slip beneath her towel, gently massaging her breast.#You hear Alex and Leah rustling behind you, and turn back to see that Alex has his pants off and Leah is gently licking the tip of his cock.#A quick glance back inside the bathhouse lets you know that Penny is planning on taking her time, her hand still slowly squeezing her breast, though you can see that her breathing is getting heavier.\"/speak Leah \"*slurp* I lied a little earlier, when I told you know I didn't know what was up with Penny. I got a mysterious letter, and Maru has seen Penny coming up here more than usual, so I thought it might be her.#$b#I think it's one of her fantasies to have people watch her masturbate, so she must have sent the letter to us anonymously.\"/speak Leah \"Of course, right now she doesn't know for certain that we're out here, but I think the IDEA of being watched is what's most important to her.\"/message \"Leah goes back to sucking off Alex, who is more than happy to be on the receiving end of Leah's blowjob. His hand is on the back of her head, and you can hear him whispering words of encouragement to her.#You look back inside the bath house, and can see that Penny's towel is on the floor, and she is entirely focussed on fingering herself, the book forgotten at this point.#From this angle you can see that she has two fingers buried inside her pussy, and you can only imagine the wet sounds that must be echoing in there, feeding her desires.#Alex grunts in satisfaction, and you glance back to see Leah taking him deeply down her throat. The sound of her swallowing lets you know that Alex has finished, and Leah's moans let you know that she's not far behind either.\"/speak Leah \"Wow, that was something else. I can see why Penny likes having someone watching. How about you, Alex?\"/speak Alex \"Give me a moment, Leah. You literally sucked the life out of my balls.\"/pause 700/speak Alex \"Wow, my legs are all weak like when I used to play gridball.#$b#I guess I came harder than I normally do, but I think that's only because it was you and @. I'm more of a do-er than a watch-er, and I don't think I'd be into this if it was anyone else.\"/question \"#Would you want to do it like this again, guys?\"/message \"Leah and Alex look at each other for a moment, than back at you, grins on their faces.\"/speak Leah \"I think that both of us are up for it. We'd love you to join in, but would never want to pressure you into something that makes you uncomfortable.\"/speak Alex \"If you ever want to take Leah's place I'm sure she wouldn't mind.#$b#I don't think Penny had her fill yet either if you wanted to go check on her.\"/pause 300/message \"It's getting late, but I'm sure Penny would appreciate some company the next time.\"/addConversationTopic MTV_BathhouseFun 1/addMailReceived MTV_PennyQ2T/end"
      }
    },

    //Ridgeside Keahi - not tested/formatted
    {
      "LogName": "RidgesideVillage Blair/Keahi event",
      "Action": "EditData",
      "Target": "Data/Events/Custom_Ridgeside_RidgesideVillage",
      "Entries": {
        "594815/f Blair 600/f Keahi 600/c 1/e 75160309/t 700 1800/w sunny": "playful/50 60/farmer 49 67 0 Blair -100 -100 2 Keahi -100 -100 0 Lola -100 -100 0/skippable/showFrame Blair 26/move farmer 0 -7 0/doAction 51 59/emote farmer 8/warp Blair 50 60/faceDirection Blair 3/textAboveHead Blair \"Gotcha!\"/jump farmer 8/pause 300/textAboveHead Blair \"Dang...\"/pause 300/speak Blair \"Wait, it's you again, @! I was totally waiting for Keahi...\"/pause 300/speak Blair \"You'll have to hide with me again. Keahi will be here soon, and he's going to be suspicious after last time.\"/warp Blair -100 -100/doAction 51 59/move farmer 1 0 1/warp farmer -100 -100/pause 300/doAction 51 59/pause 300/speak Blair \"Is it hot in here again, or is it just me...?\"/doAction 51 59/textAboveHead Blair \"*rustle rustle*\"/pause 300/speak Blair \"Those twigs get everywhere. I can feel them poking me all over. How about you?\"/question null \"#er...It's not great in here.\"/doAction 51 59/textAboveHead Blair \"*rub rub*\"/pause 300/speak Blair \"Try not to make any sound, ok? I don't want Keahi to hear us.\"/doAction 51 59/doAction 51 59/textAboveHead Blair \"*rub rub*\"/pause 300/message \"*You can feel Blair wriggling around, trying to avoid the branches in the bush. Every time she moves, it seems that you get poked too.*#*She is clearly the one making all of the noise.*#*Eventually you've had enough*\"/question null \"#Grab her hips to keep her still.\"/message \"*When your hands firmly grasp her she shivers a little*\"/speak Blair \"*Eep!* What are you doing back there, @? You're making it really hard for me to focus.\"/question null \"#You're not exactly making it easy for me either, with your butt wiggling in front of my face.\"/message \"*As you say this, a naughty idea spreads throughout your mind*\"/question fork0 \"What would you like to do?#Give in to your desires#Focus on surprising Keahi\"/fork 594815d/message \"*You shake your head, and take your hands off of Blair's butt, content to store this memory away in your mind for later.*#*You manage to keep quiet, but Blair is definitely struggling to keep focussed. After a short while you feel her stiffen in front of you, and assume that Keahi has appeared in her field of view*\"/pause 300/speak Blair \"Keahi's here! Get ready\"/warp Keahi 49 50/move Keahi 0 8 2/beginSimultaneousCommand/warp Blair 49 59/warp farmer 50 59/faceDirection Blair 0/faceDirection farmer 0/endSimultaneousCommand/message \"You both tense, and in a moment Blair jumps out with you hot on her heels. Keahi is knocked down on his butt in surprise.\"/speak Keahi \"Blair! And @!? I'm surprised you would prank me the same way twice. You've got to come up with something new next time, ok?\"/emote farmer 4/pause 300/fade/viewport -100 60/speak Blair \"Don't worry about what he said. We got him so good that time! You're a great partner, @. Err, not that kind of partner. At least, not yet.\"/end",

        //split-deviant
        "594815d": "message \"*You look at the wonderful ass inches in front of your face, and start to come up with a plan.*#*You start sliding your hands down Blair's thighs, making her think that you're taking your hands off of her.*#*You slowly place one finger right at the top crease of her backside, and gently start stroking it up and down, imperceptibly softly at first, but slowly gaining force.\" /speak Blair \"Err, are you doing something back there, @?\"/question \"#There's a stick right up against your butt. I tried to move it, but it's tangled too much and keeps moving around as you wiggle.\" /message \"*You can see that Blair is trying to stay as still as possible so you can move the stick, but staying still lets you do whatever you want instead.*#*You take a stick from the bush, and start using it to rub back and forth against her pants, right where her clit would be.*\" /speak Blair \"Do you think you could...try and move it away again? It's really uncomfortable for me, and keeps poking my...err...my butt\" /message \"*Despite her words, you can tell she's into it. She has started pushing back against it when you reach her clit, and is making noises you're sure she thinks are silent.*\" /message \"*Growing bored of the stick, you start rubbing her pants directly. You use your thumb to rub against her ass while your fingers aggressively rub her clit*\" /speak Blair \"@...I know what you're really doing back there. I'm ok with it, but...it's not enough. You can pull my pants down if you want? ...please?\" /message \"*You do exactly as she asks, shimmying her pants to her knees, smelling her arousal for the first time. You can see that her panties were soaked, and take a moment's pride in that before you lean forward and lick her.#It's a little hard to reach much in this position, but you feel her whole body shudder from the wet sensation.*\" /speak Blair \"Oh Yoba, that felt so good. I don't even care about surprising Keahi any more.\" /message \"*You go back to using one hand, finger fucking her snatch, knowing that anyone around would hear the bushes rustle and Blair quietly moaning*#*You can feel her getting closer, and think of a way to make her cum super hard. As her gasps get shorter and shorter, you can tell she's almost there, and frantically rub her clit with your fingers as you lean forward and stick your tongue in her ass.*#*She shudders and lets out a long, low moan for several seconds, before collapsing on the floor, pinning your hand beneath her.*\"/warp Lola 50 55/move Lola 0 4 2/faceDirection Lola 1/speak Lola \"What do we have here in the bushes..?\" /message \"*The sunlight filters through the bushes as Lola looks down on the two of you, Blairs pants still around her knees, and your hand between her legs.*\"/speak Blair \"Oh no! Lola, I..\" /speak Lola \"You were being a pervert in the bushes with @, having sex.#I didn't know you had that kind of kink, Blair.\"/quickquestion What do you say?#Blair's ass was too distracting#We were waiting to surprise you.(break)speak Blair \"I can't believe you would say that. But thanks I guess\"(break)speak Blair \"Yeah! It was all a surprise! We were going to jump out at you.\"/pause 300 /speak Lola \"This doesn't look like that. In fact, I think the two of you are going to have to face some consequences this time. I think Lenny needs to hear about this.# Unless...you want me to deal with your consequences myself?\" /message \"*Blair looks at you, a little bit of fear in her eyes, but not able to make the decision herself*\"/question \"I guess we don't have a choice.#How much is it going to cost us?#What can we do to make amends?#Could we persuade you somehow?\" /speak Lola \"I think you really need to learn from this. Did no-one teach you that avoiding consequences is bad for you in the long run?#I'll let you know when I've thought of something suitable.\"/end"
      }
    }
  ]
}