{
  "FarmerCollectCum": "_____You free your penis and start using one hand to gently stroke it, and the other to massage your balls. You close your eyes as you start to imagine someone leaning down and engulfing your cock between their lips.#You pick up your pace as their imaginary mouth starts sucking harder, occasionally flicking your tip with their tongue. Your clench your eyes tighter as your cum starts to spurt out, painting the inside of your jar. You seal the lid with a contented sigh.",
  "FarmerCollectionMilk": "_____You glance around for a mo to see if anyone is watching you, then slip your top over your head. You start massaging you breast, and your nipples are soon standing proud, calling for attention.#As you start kneading in earnest, a trickle quickly emerges from the sides of your nipple, and quickly becomes a stream. The flow increases as you find your rhythm, and the drip-drip of it collecting in your bottle is hypnotising.#After several minutes of switching between breasts you are much emptier, and you pull your top back on. The fabric rubs against your slightly sore nipples.",
  "QuestStartFail": "Sorry, I don't have any quests written for me yet.",
  "QuestStartSuccess": "A drink? Sure, anything that comes from %farm is always tasty. (Quests starting)",
  "eat_out": "You want to go down on me? I don't think I've ever had someone offer to do that without an ulterior motive before.$h#$b#%*She quickly strips out of her lower garments, and opens her legs wide for you. You're greeted with a heady smell, and notice that her lips are starting to swell*#$b#%*You lean in and start licking between her lips, tasting her sweet nectar as she buries her hands in your hair*#$b#%*As her moans get louder you use your tongue to flick her clit, and she clenches her legs tightly around your head*#$b#%*You gently suck on the nub, and then plunge your tongue as deeply into her as you can, shaking your tongue from side to side to stimulate them even more*#$b#@, I'm cumming!"
}