{
  "patio_Trunip": "Oh just because we're married doesn't mean I'm doing farm work for free. ",
  "Rainy_Day_Trunip": "Rain, rain, go away... I used to sing that to my boy. ",
  "Rainy_Night_Trunip": "The rain used to put my boy to sleep in the night. He'd cry when there was thunder though. He'd sleep easy in his mother's arms even then. ",
  "Indoor_Day_Trunip": "I'll clean up a bit, but I expect some payment, toots. ",
  "Indoor_Night_Trunip": "I prefer my payment in cash, but I'll accept a meeting under the sheets too. ",
  "Outdoor_Trunip": "Just enjoying the day. Wondering what I want you to bring home for dinner. ",
  "funLeave_Trunip": "Don't miss me too much, sweet thing. ",
  "funReturn_Trunip": "You missed me that much, doll?",
  "jobLeave_Trunip": "Don't miss me too much, sweet thing. ",
  "jobReturn_Trunip": "You missed me that much, doll? ",
  "Rainy_Day_0": "Rainy days remind me of my boy. ",
  "Rainy_Day_1": "Rainy days remind me of my boy. ",
  "Rainy_Day_2": "Rainy days remind me of my boy. ",
  "Rainy_Day_3": "Rain, rain, go away... I used to sing that to my boy. ",
  "Rainy_Day_4": "Rain, rain, go away... My boy's mother used to sing that to him. ",
  "Rainy_Day_5": "My boy used to love rainy days. Well, I think he liked the song his mother sang to him. ",
  "Rainy_Night_0": "My boy used to sleep like a baby to the sound of rain. ",
  "Rainy_Night_1": "My boy used to sleep like a rock to the sound of rain. ",
  "Rainy_Night_2": "My boy used to sleep like a rock to the sound of rain. ",
  "Rainy_Night_3": "My boy used to cry during thunder storms. He'd sleep easy in his mother's arms even then. ",
  "Rainy_Night_4": "My boy used to cry during thunder storms. He'd sleep easy in his mother's arms even then. ",
  "Rainy_Night_5": "My boy used to cry during thunder storms. He'd sleep easy in his mother's arms even then. ",
  "Indoor_Day_0": "I'm gonna stay in and watch a movie. ",
  "Indoor_Day_1": "I'm gonna stay in and watch a movie. ",
  "Indoor_Day_2": "Do they have anime channels on this side of the planet? ",
  "Indoor_Day_3": "You got games on your phone? ",
  "Indoor_Day_4": "You should buy a better TV. ",
  "Indoor_Day_5": "Wanna stay in and make out? ",
  "Indoor_Night_0": "I cooked dinner. I left you some in the fridge. ",
  "Indoor_Night_1": "I left some tea for you on the counter. ",
  "Indoor_Night_2": "Come to bed soon, yeah? ",
  "Indoor_Night_3": "You wanna make out? ",
  "Indoor_Night_4": "Come under the covers, baby. ",
  "Indoor_Night_5": "Meet me in bed?",
  "Outdoor_0": "Ah, the outdoors feels like home. Probably because it was home for a long while. ",
  "Outdoor_1": "Your farm is kinda ugly. You should fix that. ",
  "Outdoor_2": "I could help take care of the farm for a price. ",
  "Outdoor_3": "You want me to help take care of the farm? Fifty bucks an hour. ",
  "Outdoor_4": "I'm gonna play with %pet today. ",
  "Outdoor_5": "The air smells like shit out here. ",
  "OneKid_0": "%kid1 really makes me miss my boy. ",
  "OneKid_1": "Another little miracle in my life... ",
  "OneKid_2": "I hope I can be a better father this time around. ",
  "OneKid_3": "Should we sell them to the Zen'ins? ",
  "TwoKid_0": "Two little miracles, hm? I guess that's three I've put into the world. ",
  "TwoKid_1": "If we sold them off we could get twice as much money from the Zen'ins. ",
  "TwoKid_2": "I wonder if either of them will be like my first one...",
  "TwoKid_3": "You think the kiddos will like having me as a dad? ",
  "Good_0": "Wanna make out? ",
  "Good_1": "Wanna hop under the covers with me?",
  "Good_2": "We should stay in together and have some fun. ",
  "Good_3": "I took twenty bucks from your dresser. Thanks, babe. ",
  "Good_4": "I kinda like being married to you, you know. ",
  "Good_5": "Sweet thing. So glad I landed a pretty one like you. ",
  "Good_6": "Work hard and make lots of money, okay? ",
  "Good_7": "Sometimes you remind me of her. ",
  "Good_8": "Yeah. I'll definitely look at job listings, babe. ",
  "Good_9": "Should I get a job? Ha, just kidding. Love you, baby. ",
  "Neutral_0": "Could be better, could be worse. Today is just another day. ",
  "Neutral_1": "Wanna make out? ",
  "Neutral_2": "Today would be a lot better if we were kissing. ",
  "Neutral_3": "Bring me home lobster, yeah? ",
  "Neutral_4": "Bring some expensive alcohol home. ",
  "Neutral_5": "Days like today... Really make me miss her. ",
  "Neutral_6": "You should pay to send me to therapy. ",
  "Neutral_7": "Can I have some cash?",
  "Neutral_8": "You shorted me on my allowance, so I took the rest from your dresser. ",
  "Neutral_9": "Baby, we should make out. ",
  "Bad_0": "I'm not in the mood today. ",
  "Bad_1": "You will never be anything like my first wife. ",
  "Bad_2": "You know I kept my name because it was my first wife's, right? ",
  "Bad_3": "I'm too tired to deal with you at the moment. ",
  "Bad_4": "You haven't given me money in days. It's like you don't even love me. ",
  "Bad_5": "Baby of course I love you. That's why I sleep with you. ",
  "Bad_6": "If I didn't love you I wouldn't be so comfortable spending your money. ",
  "Bad_7": "I'm not in the mood today. ",
  "Bad_8": "Brush your teeth before you try to kiss me. ",
  "Bad_9": "Aht. Oi, Garlic Breath. Don't try to kiss me if you're gonna be nasty. ",
  
    "FarmerCollectCum": "You free your penis and start using one hand to gently stroke it, and the other to massage your balls. You close your eyes as you start to imagine someone leaning down and engulfing your cock between their lips.#You pick up your pace as their imaginary mouth starts sucking harder, occasionally flicking your tip with their tongue. Your clench your eyes tighter as your cum starts to spurt out, painting the inside of your jar. You seal the lid with a contented sigh.",
  "FarmerCollectionMilk": "You glance around for a mo to see if anyone is watching you, then slip your top over your head. You start massaging you breast, and your nipples are soon standing proud, calling for attention.#As you start kneading in earnest, a trickle quickly emerges from the sides of your nipple, and quickly becomes a stream. The flow increases as you find your rhythm, and the drip-drip of it collecting in your bottle is hypnotising.#After several minutes of switching between breasts you are much emptier, and you pull your top back on. The fabric rubs against your slightly sore nipples.",
  "QuestStartFail": "Sorry, I don't have any quests written for me yet.",
  "QuestStartSuccess": "A drink? Sure, anything that comes from %farm is always tasty. (Quests starting)"
}