{
  "Name": "Readi Milk", //The name you would like your object to have, this should be identical to the subfolder name.
  "Description": "A bottle of enchanted milk that encourages healthy growth. Give to someone to start quests with them.", //Description of the product.
  "Category": "Junk", //This should match the crop.json Type or for fruit trees should be one of the following: Flower, Fruit, Vegetable, Gem, Fish, Egg, Milk, Cooking, Crafting, Mineral, Meat, Metal, Junk, Syrup, MonsterLoot, ArtisanGoods, and Seeds.
  "Edibility": -300, //Edibility is for health, energy is calculated by the game. For inedibile items, set to -300.
  "Price": 1, //How much your item sells for.
  "IsColored": false, //(optional) Set this value to true if your product is colored. Primarily applies to flowers.
  "Recipe": null, //Set to null.
  "GiftTastes": //If an NPC isn't listed their gift taste will be neutral. If every NPC is specified you may remove unused categories.
  {
    "Love": [ "Robin", "Demetrius", "Maru", "Sebastian", "Linus", "Pierre", "Caroline", "Abigail", "Alex", "George", "Evelyn", "Lewis", "Clint", "Penny", "Pam", "Emily", "Haley", "Jas", "Vincent", "Jodi", "Kent", "Sam", "Leah", "Shane", "Marnie", "Elliott", "Gus", "Dwarf", "Wizard", "Harvey", "Sandy", "Willy", "Krobus", "Leo" ], 
    "Like": null,
    "Neutral": null, //Example of `null`. Can also remove if not being used.
    "Dislike": null, //Example of multiple NPC
    "Hate": null
  },

  // Localization

  "NameLocalization": {
    "es": "Leche para readi", //Spanish
    "ko": "readi 우유", //Korean
    "de": "Readi Milch", //German
    "fr": "Lait de lecture", //French
    "hu": "Olvasó tej", //Hungarian
    "it": "Milk readi", //Italian
    "ja": "Readi Milk", //Japanese
    "pt": "Leia leia", //Portuguese
    "ru": "Риджи молоко", //Russian
    "tr": "Okuma sütü", //Turkish
    "zh": "readi牛奶" //Chinese (Simplified)
  },
  "DescriptionLocalization": {
    "es": "Una botella de leche encantada que fomenta un crecimiento saludable. Darle a alguien para que comience misiones con ellos.", //Spanish
    "ko": "건강한 성장을 장려하는 마법의 우유 한 병. 그들과 함께 퀘스트를 시작할 누군가에게주십시오.", //Korean
    "de": "Eine Flasche verzauberte Milch, die ein gesundes Wachstum fördert. Geben Sie jemandem, um mit ihm Quests zu beginnen.", //German
    "fr": "Une bouteille de lait enchanté qui encourage une croissance saine. Donnez à quelqu'un pour commencer des quêtes avec eux.", //French
    "hu": "Egy üveg elvarázsolt tej, amely ösztönzi az egészséges növekedést. Adj valakinek, hogy kezdje el velük küldetéseket.", //Hungarian
    "it": "Una bottiglia di latte incantato che incoraggia una crescita sana. Dai a qualcuno per iniziare le missioni con loro.", //Italian
    "ja": "健康的な成長を促進する魅惑の牛乳のボトル。誰かに与えて、彼らとクエストを始めましょう。", //Japanese
    "pt": "Uma garrafa de leite encantado que incentiva um crescimento saudável. Dê a alguém para iniciar missões com eles.", //Portuguese
    "ru": "Бутылка зачарованного молока, которая поощряет здоровый рост. Дайте кому -нибудь, чтобы начать квесты с ними.", //Russian
    "tr": "Sağlıklı büyümeyi teşvik eden bir şişe büyülü süt. Onlarla göreve başlamak için birine verin.", //Turkish
    "zh": "一瓶魔法牛奶，可以鼓励健康的生长。给某人开始与他们一起任务。" //Chinese (Simplified)
  },
}