{
	"Changes":[
		{
			"LogName":"Abigail",
			"Action":"EditData",
			"Target":"Characters/Dialogue/Abigail",
			"Entries": {
				"Introduction": "Oh, that's right... I heard someone new was moving onto that old farm.#$e#I used to love exploring those old fields. I could hide in the weeds, strip naked and masturbate as much as I wanted. $9#Now I guess I'll have to do all of my camgirl streams in my room.",
				"spring_mon2": "Did you know that Monday night is my streaming night?",
				"spring_mon4": "Did I tell you that Monday night is my streaming night?#Have you checked out my site, 'Purple Showers'?",
				"spring_mon6": "People keep asking me to play with strawberries on my show!#Don't any of them listen to me when I say that I hate strawberries?#Even if they pay me I won't eat them, let alone put them in my pussy",
				"spring_mon8": "I'd love to have you join me on my show. You could tie me up and see how many sticks of rhubarb you can fit in my pussy.#Then I could eat them while you fuck my ass.",
				"summer_Thu2": "Hi.$l#$e#Do you feel like everything seems unreal lately?$l#$b#Not in a bad way, though, just like a fantasy. Not THAT kind of fantasy, unless you were thinking of something kinky? $h#$q 300123 Shop_no#Do you want to do something kinky?#$r 300121 0 sex_finger#Grope her under skirt until she cums#$r 300121 15 sex_suck#Get under her skirt and lick her#$r 300121 0 sex_tieup#Tie her up and tease her#$r 300123 -15 Shop_no#Not right now",
				"summer_Thu4": "If you get any blueberries you should bring me them.",
				"summer_Thu6": "If you get any blueberries you should bring me them.#I'd love to put them inside my pussy and push them out on my show.",
				"summer_Thu8": "If you get any blueberries you should bring me them.#I'd love to put them inside my pussy and have you fuck me with them inside",
				"summer_Mon": "When it's this hot all I can do is lie in my room naked. It's too hot to do ANYTHING right now.",
				"summer_Tue8": "The air is so thick with honey and nectar all summer, I almost feel dizzy.#I might need you to hold me to stop me swooning.$I might fall for you, but on my hands and knees, so you can fuck me doggy-style. $u",
				"summer_Wed": "Have you decorated your house at all? That's what I'd be doing if I had a house. That, and having sex in every room.",
				"summer_6": "I went to the beach last night, after dark... Sometimes you can see strange lights bobbing over the sea.#$e#Or maybe that was just a dream I had... It doesn't feel real anymore. All I know is that I woke up really sore between the legs. Must have been a really vivid dream.",
				"summer_Fri": "I kind of wish I had a cat. Unfortunately, my Dad is allergic to pretty much everything. My mum says there is only one pussy he's ever stroked in his whole life! ",
				"summer_Fri6": "I kind of wish I had a cat. Unfortunately, my Dad is allergic to pretty much everything.#Sometimes I dress up as a cat and lounge around in my room naked. If you come over remember to give me 'milk'.",
				"summer_Fri8": "Sometimes I dress up as a cat and lounge around in my room naked.# If you come over remember to give me 'milk'#You can pull on my tail and fuck me while I 'mew'",
				"summer_Sat": "I'm looking forward to fall... the cool mountain breeze, the swirling red petals, the smell of mushrooms... *sigh* and lets not forget mushroom cream. *wink*",
				"fall_mon2": "My show hasn't been getting many views. $s #$b#Do you have any suggestions on how I can get more views?",
				"fall_mon4": "I've been getting more views for my show lately. People don't seem to tip much, but it's better than I could earn in the valley.",
				"fall_mon6": "My show is one of the most popular on the channel! $h #I try not to think about it too much, but over 1,000 people watch me. # It makes me nervous thinking about all of those strange men...and women.",
				"fall_mon8": "How is the farm going? If business slows down let me know. #You could come on my show and let them see me get 'plowed' by a real farmer.",
				"fall_sat4": "I'm so glad it's fall. It's getting cooler, and there is still so much bumpy corn in your fields.",
				"fall_sat6": "I'm so glad it's fall. It's getting cooler, and there is still so much bumpy corn in your fields.#If you bring my some I can use it on y show on Monday night.",
				"fall_sat8": "I'm so glad it's fall. It's getting cooler, and there is still so much bumpy corn in your fields.#You should bring my a really big one so you can fuck me with it on my show $h",
				"fall_wed4": "I think my favourite vegetable has to be eggplant. Did you know in France they call it 'aubergine?",
				"fall_wed6": "If you want to make me smile bring me an eggplant. #I love how shiny and smooth they are. It's like a giant cock! $h",
				"fall_wed8": "Is that an eggplant in your pocket or are you just happy to see me?#Whichever one it is I'd love to have it stretch me out and fill me up",
				"winter_Sat6": "Did you come to visit @'s very own camgirl? There's nothing under my skirt today, and I start dripping any time I see you.#$q 300002 sex_choices#Want a quickie?#$r 300121 0 sex_finger#Grope her under skirt until she cums#$r 300121 15 sex_suck#Get under her skirt and lick her#$r 300121 30 sex_fuck#Fuck her right now#$r 300120 -15 sex_no#Not right now",
				"Mon8": "...Oh, @! Hi.$h#$e#Want to hang out for a while? Here! Let me read your palm. *giggle* I can have a look at other parts if you want. *wink* $h",
				"Sat6": "You came all this way to visit me? Someone must want me bad. ,)$h#$e#So have you been exploring the mountain caves at all?#$e#Interesting. I'd like to go there myself one of these days. Or you could explore my cave of wonders. It's pretty wet right now$l",
				"Tue4": "Hi, I'm glad to see you.$h#$e#I want to take my mind off things for a while... fancy a quickie?",
				"Wed2": "Oh, hi @. Taking a break from your work?#$e#Me too. Oh! Nothing physical... just some online classes I'm taking. I don't even have to get dressed for them, and I can play with myself as much as I want.",
				"Mon2": "Oh, hi!#$e#Do you ever hang out at the cemetery? It's a peaceful place to spend some time alone. Sometimes a girl needs to find somewhere...private... at night. *wink*",
				"Wed": "Hey. Sorry in advance if I say anything rude. I didn't get much sleep last night.#I won't be walking much today either.$e#What do you want?",
				"Sun": "Oh man... I've been pushing off my homework all weekend. Looks like I'll be pulling another all-nighter...#And not the playing with myself kind either.$s",
				"grave_choice": "I wonder what would happen if I spent all night in the graveyard?#$q 18 Sun_old#@, What would happen to me alone in the graveyard?#$r 17 0 grave_boring#You'd probably fall asleep.#$r 18 40 grave_ghosts#I think ghosts would watch you play with yourself.#$r 17 0 grave_boring#You might see a zombie.#$r 18 0 grave_boring#Your dad would come find you.#$r 17 30 grave_fuck#I'd tie you up and fuck you against the headstone.",
				"grave_boring": "That would be boring. Maybe I should just stay home and play porn online.$s",
				"grave_ghosts": "Hah! Maybe they'd shower me in ghost cum!$h",
				"grave_fuck": "Promise? The ghosts could masturbate to that and cover me in their ghostly cum.$8#$b#I could pretend I'd been at a rave. A naked rave.$h",
				"vacation_choice": "Do you ever get an urge to go exploring, @?#$q 300030 vacation_followup#Okay... pretend you just won a free vacation. Where would you take me?#$r 300025 30 vacation_bed#Anywhere, as long as it has a bed and you are with me.#$r 300025 0 vacation_cave#In a dark cave#$r 300025 30 vacation_forest#The old, gnarled forest#$r 300025 15 vacation_resort#A nudist resort#$r 300030 -30 vacation_skip#Don't ask me again",
				"vacation_bed": "Ooh! Should I bring some candles? $h #$b#And a blindfold? And handcuffs?",
				"vacation_cave": "We could go adventuring! You'd have to promise to let me use a sword though.",
				"vacation_forest": "A spooky forest? I'd strip naked and you could chase me through the trees. If you catch me you could tie me up and fuck me under the stars",
				"vacation_resort": "A nudist resort. Right. Your girlfriend is a camgirl and you want to go to a nudist resort? $s",
				"vacation_skip": "Fine then",
				"vacation_followup": "$p 300025 # I look forward to it. $h| I guess I'll have to find another vacation buddy. $s",
				"camgirl_choice": "Oh, hello.#$b##$q 300130 camgirl_followup#Which of these photos of me looks sexier?$e#$r 300128 20 camgirl_rope#The one with just a bit of rope hanging between your breasts.#$r 300129 5 camgirl_spread#The one with your legs spread and your finger in your mouth.#$r 300130 -15 camgirl_borrow#They're both pretty sexy, but I think I need to study them. Can I take these?",
				"camgirl_rope": "You can use that rope to lead me around like a puppy.#$b#If you want to, I mean.#$b#I could put a tailplug in and you could pull on it while you fuck me.",
				"camgirl_spread": "Do you have something I could suck on?#$b#Or something big that can fill me up?#$b#You could always be a guest star on my show.#$b#I'd let you cum on my tits, or in my pussy.",
				"camgirl_borrow": "Sorry, but if you're going to be looking at me naked then you'd better be making me feel good first.",
				"camgirl_followup": "$p 300128/300129#Remember those photos I showed you a while ago? I can model some in person if you want.#$p 300130#Did you have a good time with my camsite photos? $h",
				"sex_choices": "Okay, what are you waiting for?#$q 300123 Shop_no#$e#You can do whatever you want to me.#$r 300121 0 Shop_finger#Grope her under skirt until she cums#$r 300121 15 Shop_suck#Get under her skirt and lick her#$r 300121 30 Shop_fuck#Fuck her right now#$r 300123 -30 Shop_no#Stop asking me.",
				"sex_finger": "What are you doing with your hand?#$b#Someone is feeling frisky today! Ooh, you're rubbing my slit...Yeah...that's the spot. Keep rubbing there! Mmmm.#$b#Oh! You went inside! I can feel your fingers pushing inside and spreading me! *wet noises* Keep going! I'm going to cum soon!#$b#*Abigail moans loudly* Cumming! Thanks honey, it's always 10x better when you do.#$b#Here, let me lick your hand clean.",
				"sex_suck": "That's right. Keep licking my pussy#$b#Mmmm! I can feel your tongue inside me! That's so good! Keep licking there! Mmmmmmm!#$b#Did you hear that? Oooooh! I can hear someone! You have to stop! Please...Oh no! Here...I...CUM!#$b#*pants* Wow! I can't believe you licked me while someone was right there - it was so intense!#$b#I guess they know what we were doing. You are the best.#$b#Let me lick my cum off of your face, you dirty boy.^Let me lick my cum off of your face, you dirty girl.",
				"sex_fuck": "#$b#I want it rough today - push me against the wall while you ram it in. Oh god, it's in so deep! Keep ramming it in as hard as you can.#$b#*squelch* I can feel my juices running down my leg! *pound* *pound*  I'm getting closer...keep going!#$b#Mmmmm, fuck me, fuck me, FUCK ME! *Abigail goes limp as you cum deep inside her*#$b#Wow. Just...wow! I'm going to be leaving a trail for a while with all that cum inside me.",
				"sex_tieup": "#$b#Do you always carry rope? I could be your very own sex slave, and you could tie me up in the dungeons.#$b#*You tie Abigail's arms behind her back* Hmmm, I think I like where this is going. It feels so naughty when you grope my breasts, and there's nothing I can do to stop it.#$b#Where is your hand going? Do you think you can do anything you want to my pussy and I won't stop you? Just...like...that...#$b#Oooh yeah! You're going to make me ruin my panties! Actually, I think they're already soaking wet.#$b#*You pull her legs apart, take off her panties, then stuff them in her mouth* Mmmff! *You keep fingering her until she climaxes hard, then take the panties out of her mouth and untie her hands.*#$q 300123 panties_no#Do you give her panties back? $e#$r 300131 0 keep_panties#Keep her panties#$r 300132 15 keep_panties#Give her panties back",
				"panties_keep": "#$p 300131#What do you mean you're keeping them? Anyone could see up my skirt! /addObject 10 17 {{spacechase0.JsonAssets/ObjectId:[{{Abigails Panties}}]}}|I might taste awesome, but you have some making up to do next time. I might blindfold you and tease YOU instead.",
				"sex_no": "Not right now. Someone might see us",
				"milk_start": "Please be gentle, they are really sore today.#$b#%*You sit down as she lies across your lap, letting her breast hang down. She gives you a bottle and you start kneeding her breasts as gently as you can*#$b#%*Milk collects in the bottle as you expertly milk her, moving on to the second breast when the first runs dry*#$b#Thank you. It's so much more erotic when you do it.#$b#Just think of this as taking care of one of your 'cows'. Here, you can keep this.",
				"eat_out": "You know I’m always down for an adventure...wanna adventure down on me?#$b#%You sweep in to kiss her tenderly, only to be met with ferocity and passion. She grabs your shirt and pulls you in, grabbing your hand and ushering it down the front of her pants. #$b#%Your fingers meet her soft, warm wetness. Gently, you stroke her clit with your middle finger, coating it in her juices.#$b#%She leans backwards against a wall, pulling you with her. You crouch down and tear off her pants and underwear; using the wall as leverage, she wraps her legs around your head.#$b#%Pressed between her thighs, you submerge yourself into her pussy. Despite the low light you can see that her hair there is purple too.#$b#%Holding her hips agains the wall with your hands, you lick up her juices from between her folds, before arriving at her most sensitive area.#$b#%There, you trace your tongue in a variety of motions. You hear her gasp and she pulls on your hair as if it’s her tether to earth.#$b#Right there!Right there! Like that!$l#$b#%You repeat the motion, in the exact same tempo, and she writhes and bucks under your touch. The more you continue, the more vice-like her thighs become.#$b#@!#$b#%Suddenly she all but screams as she clenches around you. A literal wave of warm liquid hits your face, soaking you as Abby moans and stares wide-eyed at nothing in particular.#$b#%You lower her to the ground, and she slowly retrieves her pants as you wipe your face.#$b#Where...the FUCK...did you learn that?",
				"get_eaten": "",
				"sex":""
			}
		}
	]
}