{
	"Changes":[
		{
			"LogName":"Caroline",
			"Action":"EditData",
			"Target":"Characters/Dialogue/Caroline",
			"Entries": {
				"milk_start": "My breasts are so sore, I NEED someone to milk them. Pierre is so obsessed with his 'business' that he doesn't pay attention to me any more.#$b#%*Caroline sits down on a nearby seat, and you can see that milk is already leaking through her top. She smiles embarrassedly, and pulls her vest to the side*#$b#Don't be shy, @. It's perfectly natural to feel aroused in this situation, and it's not like I'm going to jump you or anything...This time at least.#$b#%*You bring the bottle to her chest, and start coaxing a steady stream of milk out of her overflowing tits*#$b#%*You end up with a generous amount coating your hands, and Caroline spends some time using her mouth to suck all of the milk off of your fingers*#$b#Aw, thanks honey, I feel much better now. I wouldn't want to waste anything, and all of my juices taste SO good. Maybe I can taste yours next time?",
				"eat_out": "Pierre refuses to go down on me. I could really use some attention down there, it’s been too long.#$b#%Caroline guides you to a counter and hops up on it. You help her remove her pants, and gingerly pull down her underwear.#$b#%Her panties are nothing special, showing that she hasn’t been expecting much action recently. She eagerly spreads her legs for you, revealing a soft pink pussy in a sea of green.#$b#%You lean in and lick her womanhood gently, and begin exploring her warm, inviting nether regions with your tongue.You leave no crevice, no corner left alone.#$b#%As you continue, she gets wetter and wetter until you don’t know where your saliva ends and her secretions begin. Then you find your way to her clit, gently teasing it with the tip of your tongue. #$b#%She lets out a low moan that resonates through your being.#$b#Mmmm…@...don’t stop#$b#%Caroline throws her head back and closes her eyes in ecstasy when you tweak the rhythm and intensity. You found her medium, and refuse to change your pattern.#$b#%She begins breathing harder and harder until she’s gasping for breath.In your peripheral vision you see her hands grasp the counter so hard her knuckles go white.#$b#%She pulsates and quivers and lets out a choking gasp as warm fluid coats you and trails down your chin.#$b#%She stays still for a few moments, recalibrating, and then hops down from the counter on shaky legs.*#$b#Th - th - thanks...I - I r - really n - needed that.Just need to c -catch my b-breath here.",
				"get_eaten": ""
			}
		}
	]
}