{
	"Changes":[
		{
			"LogName":"Emily",
			"Action":"EditData",
			"Target":"Characters/Dialogue/Emily",
			"Entries": {
				"milk_start": "Oh! Did you know that human breast milk is a super food?#$b#It's way better for you than cows milk...#$b#Not that your milk isn't great! Well, your cows milk. I'm sure your milk is just wonderful.$h#$b#%*She quickly bares her breasts and sigh as the cool air hits them. Her nipples are already hardening, and you reach out gently and pinch them*#$b#Oh, @! You always make me so wet when you touch me. Maybe I can 'milk' you some other time?$l#$b#$*You hold her breast in one hand, and suck on her nipple to get the milk flowing. She moans loudly as the first bit of sweet liquid enters your mouth*#$b#%*As you start milking her breast she reaches down and slips a hand inside her panties, and a heady smell wafts out*#$b#Don't mind me, I just get so horny when you're around. I'm sure I'm going to have more than one kind of liquid staining my clothes soon.$h#$b#%*You switch breasts, and her hand movements increase in speed. The sounds of her masturbating, mixed with the sound of her milk collecting in the bottle, get you very aroused*#$b#I'm cumming!!!",
				"eat_out": "I’d love to feel our energies intertwine. Come, let’s explore them.#$b#%In the blink of an eye Emily is sitting on a nearby table, smiling and lifting her dress. When you step towards her, she opens her legs and her smile turns coy.#$b#%You crouch and duck into the blue hair of her privates. As you explore her soft folds she places a hand on your head, and affectionately strokes your hair.#$b#%The affection turns into passion when you find her clit and make a variety of motions. Her nails comb your scalp.#$b#%When you start a quick looping motion, her hand stops suddenly at the back of your head and she grasps a fistful of your hair.#$b#Yes, that’s it. Keep going!#$b#%You loop around her clit, making a circle with your tongue but only adding pressure when you feel her grip tighten. You keep doing that motion, over and over, driving her closer to the edge.#$b#%Emily squirms and begins to moan, louder and louder until she yelps and releases her pleasure. It washes over your face and down your chin.#$b#%She smiles contently, her eyes closed. Then, after a moment, scoots off the table and smooths down her dress.#$b#Wow! I really feel like my Sacral Chakra is aligned. I sense a good balance within me, and it's all down to you.",
				"get_eaten": ""
			}
		}
	]
}