{
	"Changes":[
		{
			"LogName":"Haley",
			"Action":"EditData",
			"Target":"Characters/Dialogue/Haley",
			"Entries": {
				"milk_start": "Everyone always said my boobs were great. I guess I shouldn't be surprised that you love them too.#$b#I just LOVE it when guys play with my tits. They're just so sensitive, and my nipples feel heavenly when people lick or suck on them.$h#$b#%You need no further encouragement, and immediately dive into her cleavage, coating them in your saliva as you try and get her nipples into your mouth*#$b#Oh @, you don't need to go crazy. We have plenty of time for this.#$b#%*You slow down and suck teasingly on one of her nipplers, eliciting a wonderful moan from Haley. You reluctantly withdraw, and get back to the task at hand, pulling a bottle from your bag*#$b#%*You start playing with her nipple with one hand, whilst using the other to set up a steady milking rhythm. Milk is soon collecting in the bottle, and Haley is making blissful sounds*#$b#%*You switch breasts, and Haley is once again lost in her own world as you empty her breasts into your bottle. You soon finish up, and leave a drained Haley to cover up her milk-stained top*",
				"eat_out": "Oh, @, that sounds just about perfect right now. Come on then.#$b#%You crouch down to lift Haley’s skirt, but she pushes you back and instructs you to lie down. You do as you’re told and lie on your back.#$b#%Haley grins and climbs on your chest, then lifts her skirt and shuffles until she’s almost sitting on your chin. Her skirt falls and you’re in a blue tinted shadow.#$b#%She shifts and you find yourself with a mouthful of her pussy, her thighs embracing your cheeks.#$b#%You start to navigate your way in the dark and realize you found it when Haley moans aloud into the open air.#$b#%You reach up and grab her ass, pulling her more onto you, and you more into her. She grinds and rocks on your face, leaning into every motion of your tongue.#$b#%Her moans become louder and higher. Just when you think she’s close, she shifts again.#$b#You don’t think you’d get out of this without something from me, do you ?#$b#%She has turned around, her ass now facing you. You’re still unable to see through her skirt, but you feel her tug at your pants.#$b#%You’re about to resume your work when open air meets your groin, followed swiftly by the warmth of Haley’s own tongue.#$b#%It’s now a race to see who can make the other cum first. You plunge your face back into her womanhood, determined to win.#$b#%It’s difficult to concentrate, because Haley’s skill with her tongue matches and might even surpass your own.#$b#%Wading through the fog she has created in your mind, you manage to resume the rhythm from before. She squeals and you feel her voice resonate through your genitals.#$b#%You let a groan of your own escape your lips. Suddenly, her thighs clamp around your face, her hips dig into your neck, and she lets out an intense moan.#$b#%She doesn't relent, and no sooner has your face been covered in her cum has she gone right back to work on you.#$b#%Her face is soon covered as well. She rolls off of your body, lying on her back beside you, panting heavily.#$b#Okay, I’ll admit it, you’re good. I thought I was in over my head for a second. *Giggle * No pun intended.",
				"get_eaten": ""
			}
		}
	]
}