{
	"Changes":[
		{
			"LogName":"Jodi",
			"Action":"EditData",
			"Target":"Characters/Dialogue/Jodi",
			"Entries": {
				"milk_start": "I've been so lonely since Kent first went off to war, and now that Vincent is growing up so fast I didn't think anyone would ever pay attention to me again.$s#$b#Then you come along and make me feel so WANTED. I feel like I have a role to play again that is more than just cooking and cleaning. Like I'm a person again - desirable.$h#$b#%*Your hands gently caress her breasts, and her nipples quickly get hard. Jodi leans into your body and starts rubbing her thighs against your leg*#$b#%*Jodi is soon moaning alon to your ministrations, and the stream of milk starts filling the bottle. Your leg starts getting wet from her juices, and it's not long before Jodi cums hard*#$b#@! Hold me tight as I cum! I want to feel your body pressed against mine.$l#$b#%*You use your free arm to pull her in tight, the milking paused as her body is wracked with pleasure. She finally stops shaking, and rests limply in your arms. You place the bottle on the ground and kiss her deeply*Thank you for that, @. I know who to come to if I feel lonely again. Or just horny.",
				"eat_out": "Oh, it’s been too long since someone has pleasured me. Kent’s been dealing with his own problems lately, not much time for my needs. You wouldn’t mind?#$b#%To answer her question, you wordlessly guide her to the counter and hoist her up on top of it. You slide off both her jeans and panties, and discard them on the floor.#$b#%Teasingly, you run your tongue up her thighs, circling but not yet touching her pussy. She twitches with anticipation every time you come near. Eventually...#$b#Oh, fuck it.#$b#%Jodi grabs the back of your head and pushes your head right in. You’re surprised yet aroused by her sudden assertiveness. Apparently it HAS been too long.#$b#%You place your hands on the outside of her thighs and begin to swirl your tongue around the opening, dipping in every now and then, before making your way upwards to her clit, adding pressure all the way there.#$b#%As soon as you taste the round nub, Jodi gasps and leans backwards, bucking her hips. You begin to give it upward flicks of your tongue, and you feel her tense with each flick.#$b#%Then you start a rapid but light up and down motion, and her kness find their way around your neck and lock behind you.#$b#%You feel each muscle in her legs clench...#$b#Oh my goodness!!!#$b#%Shaking, Jodi releases her pleasure into your mouth. It spills down your chin and onto the floor. She doesn’t stop quivering, and takes a moment before easing herself onto the ground.#$b#%Then she stumbles over and grabs her pants and underwear with shaking hands.#$b#I’m so sorry for being so vulgar earlier, I don’t usually curse. I just really, really needed that. Now if you excuse me, I—um—have to go mop this up…",
				"get_eaten": ""
			}
		}
	]
}