{
	"Changes":[
		{
			"LogName":"Leah",
			"Action":"EditData",
			"Target":"Characters/Dialogue/Leah",
			"Entries": {
				"milk_start": "I love the way your hands feel on me, @. You might be better with your hands than me, though I'd love to have a contest some day.#$b#%*Your hands wonder over her breasts, circling slowly closer to her nipple and then dancing away. Leah gasps as you flick her nipple, and pulls away so she can remove her garments*#$b#%*You retrieve a bottle from your bag, and Leah gets into a comfortable position while you kneel beside her and start firmly squeezing her breast. Milk is soon flowing into the bottle*#$b#If you are as confident milking your cows it's no wonder that they are so happy, and produce such wonderful milk.$l#$b#%*You smirk a little at the thought of Leah dressed as a cow, with a cowbell around her neck, and tug a little harder on her nipples. You could have sworn she went 'moo'*#$b#Wow. That was a wonderful experience. Please come see me again - we can get up to all sorts of mischief in my cabin. $h",
				"eat_out": "You know, when I was dating Kel they’d never go down on me. You’re such a breath of fresh air, @.#$b#%Leah cocks her head at you, giving you a seductive look as she unclips her suspenders from her jeans. She lowers them to her ankles, and steps out of them while walking towards you.#$b#%Her lips meet yours, smoothly and tenderly. You hold her to you and she puts a palm on your chest, gently guiding you to lie down on the ground.#$b#%As she crawls up your body your hands run across her smooth, soft thighs. She settles on your face, adjusting to line up her warm, wet pussy with your mouth.#$b#%Your hand explores her thighs and waist, while your tongue explores her privates, before settling on her ass. You give it a squeeze, finding it firm and taut.#$b#%Leah begins to rock back and forth, grinding on your face and coating it in her warm succulent juices.#$b#%You have to hold her still to be able to properly maintain contact with her clit, but once you find her rhythm she squirms above you even more.#$b#%Your hands squeeze her thighs and firmly secure her to you.#$b#Fuck fuck fuck fuuggllerrggpharlgarnngh#$b#%Her words get mingled and garbled as she completely loses control. She stops writhing around and freezes, every tendon and tissue in her body tensing and seizing.#$b#%Her hands grasp the hair above your forehead and she continues to scream sounds to the open air, none of them actually forming coherant words despite her best efforts.#$b#%Her cum bursts out of her, coating your face and soaking your hair. In contrast to her previous writhing, she is now perfectly still, staring up at the sky.#$b#%The only movement is in her heaving breasts while she tries to regain a sense of composure. Then she leans off to the side and flops on the ground, completely drained.#$b#Oh Yoba, I missed...how good that feels. If you could just..toss me my pants. I’m gonna...need some time...to recover here.",
				"get_eaten": ""
			}
		}
	]
}