{
	"Changes":[
		{
			"LogName":"Marnie",
			"Action":"EditData",
			"Target":"Characters/Dialogue/Marnie",
			"Entries": {
				"milk_start": "I'm glad that Lewis isn't the only one to appreciate my big tits! He spends every moment he can in my cleavage, but he never thought to suck on them!#$b#*Marnie's milk quickly fills the jar, and she sighs contentedly as she rearranges her clothing*#$b#Make sure Lewis...I mean the Mayor...doesn't catch you! He might get jealous!",
				"eat_out": "I never thought someone as young as you would be attracted to someone my age. Lewis does his best, but I don’t think his mind is exactly with us when we’re together.#$b#I’d like to see what you have to offer.#$b#%Marnie walks over to a nearby chair, hoists up her dress, and sits down. She spreads her thick thighs and presents her pussy.#$b#%She looks at you with a mix of caution and anticipation in her eyes. You stride forward and crouch down in front of her then dive right in.#$b#%She lets out a soft gasp and lets go of the hem of her dress so it falls over and covers your head. You continue your work now shrouded in darkness.#$b#%Spreading her thighs with your hands, you explore every flap and fold. Your tongue flicks her clit, and Marnie’s gasps become sharper.#$b#%You slip a finger in and curl it upwards and find a swelled bumpy patch about an inch inwards.#$b#%When you tickle it, she lets out a cry of pleasure. Her thighs compress around you and you’re almost trapped, borderline smothered.#$b#%You continue to simultaneously work her clit and the patch inside her and the force from her thighs becomes stronger and stronger.#$b#@, I’m...I’m..!#$b#%Just when you think you’ll pass out from lack of oxygen, a stream of her cum blasts you in the face.#$b#%You pull out from underneath her dress and fall backwards on the floor, soaked, breathing hard, and gasping for air.#$b#%After the spots in your eyes clear up, you glance at Marnie. She’s looking at you with concern. You give her a smile to let her know you’re okay.#$b#Sorry, I didn’t know it was possible for oral sex to feel that good. I guess Lewis didn’t set the bar very high…",
				"get_eaten": ""
			}
		}
	]
}