{
	"Changes":[
		{
			"LogName":"Maru",
			"Action":"EditData",
			"Target":"Characters/Dialogue/Maru",
			"Entries": {
				"milk_start": "I'm sure I could come up with a machine to help with this...I'd have to do some tests to see how the level of arousal affects milk quality...#$b#%*You quickly unbutton her top to distract her, and give her nipples a quick nibble. Maru yelps and gives you a displeased look*#$b#@! Treat me properly or you can go find someone else.#$b#%*You apologise and kiss her breasts better to get her in the mood. You start gently massaging her dark skin, and it's not long before she has a content look on her face*#$b#%*I guess you aren't that bad after all, @. It looks like I'm starting to lactate - you should get a bottle ready so we can record how much fluid I'm producing.#$b#%*Maru gives you pointers, her reserved, scientific manner quickly turning into sexual encouragement. You're not sure when she started touching herself, but her panties are definitely soaked*#$b#%*Eventually the stream of milk dries up, and you show Maru how much milk is in the bottle*#$b#I'm not sure anything I make could be better than your touch.",
				"eat_out": "I mean, I’ve invented something that can do this for me. It isn’t as good as the real thing, however. No emotional connection, you know?#$b#%Maru unbuckles her overalls and shimmies out of them, pushing her panties down, too. For good measure, she also takes off her top and bra, standing before you, fully nude and confident.#$b#%You stride towards her, and she rushes to meet your embrace. You feel every curve of her against your body.#$b#%Your lips touch hers and your hands run down her back, across her ass, then around again to her front. You cup and tease her breasts, and she whimpers under your contact.#$b#%She lies down on the floor and pulls you with her. Her hands usher your head towards her pussy, and her legs straddle your torso. You begin to lick and tease her, and she writhes underneath you.#$b#%When you find her sweet spot, her hips buck. You wrap your arms around and under her thighs and continue, pausing occassionally to lap up her wetness.#$b#No...focus on the first thing...no pauses...don’t stop...#$b#%You do as you’re told, and turn all your attention into licking her clit. Maru’s hands lay flat on the ground, pressing down as her pelvis jerks upward.#$b#%You have to hold her down to continue your precise pattern. She releases a cry of pleasure and you find your face coated in her cum.#$b#%You pull back and Maru grabs a cloth from the pocket of her overalls on the floor and uses a shaky hand to wipe her climax off your face. She smiles tenderly at you.#$b#You’re a lot better than the machine. However, I would love to study your motions. Just to maybe get more ideas for an upgrade...come by again later, okay?",
				"get_eaten": ""
			}
		}
	]
}