{
	"Changes":[
		{
			"LogName": "Olivia",
			"Action": "EditData",
			"Target": "Characters/Dialogue/Olivia",
			"Entries": {
				"milk_start": "OH! @, I'm not surprised that you find me attractive, but I am a lady, not someone who would bare their breasts for anyone...$s#$b#However, you are right. You aren't just anyone to me, and it's been so long since I've felt the passion of anothers touch on my body. I'm flattered.$h#$b#%*She seductively slips her dress off of her shoulders, revealing her pale, white breasts to your gaze. You tenderly graze them with your finger tips, then, more boldy, brush her nipples*#$b#%*Olivia gasps as you lean in and gently suck on her nipple, causing a slightly sweet liquid to enter your mouth* You continue for a moment longer, and she leans back against a nearby wall*#$b#%*You bring out a bottle, and start lovingly massaging her breasts, causing her breast milk to squirt inside. After you fully drain one, you move on to the other, noting that Olivia is feeling flushed*#$b#Oh, @. You bring out the animal side of me. I never thought I would have these feelings again. I'm melting under your touch.$l#$b#%*As the milk starts to dry up, you lean in and start suckling directly from her teat. You reach down with your free hand and stroke her panties, quickly bringing her over the edge*#$b#Thank you, @, for remind me that I am still a woman, and a hot one at that.$l",
				"eat_out": "You want to eat me out? Be my guest, sweetie. Show me what you got.#$b#%*Olivia gulps down the rest of her wine and sets the glass down. She looks at you with a sense of challenge in her eyes. She may be a widow, but she’s no spinster.#$b#%Instead of lifting up her red dress, she unzips the back and lets the whole thing drop to the floor, revealing expensive black lace lingerie underneath.#$b#%She puts one hand on her hip and beckons you with the other. You charge towards her, your lips clashing with hers, you lift her up and plant her on a counter.#$b#%As you move to kiss her neck, she reaches behind her back and unhooks her bra. Your lips move to her breasts and you give her nips a little suck.#$b#%She suppresses a whimper, then you continue your journey south and remove her dark panties with your teeth, revealing a smooth, clean shaven pussy.#$b#%Olivia wraps her legs around your neck and pulls you in, in less than a second, you find yourself in her warm, silky smooth folds.#$b#%You lick her clit every which way, every pattern, every frequency you can think of, but Olivia seems to remain pleasantly content at most.#$b#%It is only when you start alternating between two particular sets of motions that she shows a change in her demeanor. Her eyes widen, she inhales a very sharp gasp, and her legs tighten around you.#$b#For the love of all things holy and unholy don’t you dare stop doing that.#$b#%You continue, careful not to change a single thing. You dare not mess up the rhythm and lose her satisfaction.#$b#%One trip up, one lost beat, and you’re afraid all the pleasure you’ve built up in her will become undone and revoked.#$b#%You concentrate so hard you barely notice that her breathing has become erratic, and her legs have clenched even more tightly around you.#$b#%It isn’t until her juices are hitting you in the face that you know you’ve done your job right. Olivia gracefully eases herself down on the floor and goes to retrieve her clothing.#$b#Hmmm..not bad, sweetie. But you should definitely stop by again sometime. For practice, I mean.",
				"get_eaten": ""
			}
		}
	]
}