{
	"Changes":[
		{
			"LogName":"Pam",
			"Action":"EditData",
			"Target":"Characters/Dialogue/Pam",
			"Entries": {
				"milk_start": "Really? I...didn't know people were into that kind of thing. I guess it wouldn't hurt, but don't expect me too go 'moo'!$n#$b#%*Pam looks around before opening her shirt, and pulling her breasts out. They sag without a bra to support them, but your magic hands soon have her nipples perking up*#$b#*You give her nipple a quick flick with your tongue, and then suck on it to taste her milk. It's sourer then normal milk*#$b#%*Milk starts to flow from her nipples into your bottle, and Pam looks down with interest as the liquid settles. She bites her lip, and you can see that your hands are having an effect on her whether she liks to admit it or not*#$b#I never would have imagined you could find anything in these old tits of mine. You are full of surprises, @.$h",
				"eat_out": "You really want to do that to me? I don’t get a lot of offers like that. Sure kid, go to town.#$b#%Pam hobbles over to a chair and pulls down her sweatpants. She lifts up her gut and spreads her legs for you. As you get close to her crotch, an odor hits your nose.#$b#%It’s a mixture of sweat, musk, and...is that booze? You have no clue how her pussy manages to smell like alcohol but dammit, your momma didn’t raise no quitter so you hold your breath and dive in.#$b#%It somehow tastes even more rank than it smells. It feels like months of working with manure at the farm have managed to strengthen your nose and stomach for this moment.#$b#%With her belly almost resting atop your head, you search for her clit through her unkempt nether hair. Once you find it, you lick it lightly and slowly. Pam responds by groaning with pleasure.#$b#Holy shit, @. That’s the ticket.#$b#%Happy that you managed to find her rhythm preference on the first try, you continue in that fashion. Pam groans louder and louder.#$b#%Suddenly streams of clear liquid ebb their way out of her and coat you. It’s over. You retreat from her depths and sit on the ground.#$b#Damn, that was a treat. You gotta do that again sometime, ya hear?",
				"get_eaten": ""
			}
		}
	]
}