{
	"Changes":[
		{
			"LogName":"Penny",
			"Action":"EditData",
			"Target":"Characters/Dialogue/Penny",
			"Entries": {
				"milk_start": "I'm always self conscious about the size of my breasts. George may leer at me, but I think that's just because I'm young and female.#$b#But with you I feel like you see me as a woman. A hot, sexy woman. I want you to see all of me, and touch all of me, without these stupid clothes in the way.#$b#%*Penny tears open her blouse, and brazenly bares her chest. You tell her how beautiful she is, and she blushes. Soon, her nipples are turning a dark shade as well*#$b#%*You start groping her chest, cupping them and squeezing them as much as you can. Penny is surprisingly sensitive, and she shyly turns her head away as you play with her*#$b#No-one has ever made me feel such things. I feel just like the women in the romance novels I read, melting under your forbidden touch.#$b#%*You start pulling on her nipples, causing milk to jet out. You try and aim it into a bottle, but Penny is writhing around in pleasure and a lot of it ends up on your face and the floor*#$b#%*As you finish up, Penny smiles at you breathlessly, clearly extremely turned on*#$b#You awaken such carnal feelings in me, @. I'm sure I look like a wanton harlot right now...and I definitely feel like one.",
				"eat_out": "Oh, @, I don’t know...are you sure? I’m a little self-conscious about that area, but if you really want to, then okay.#$b#%You hold Penny’s hands and gently guide her to a chair. You hike up her skirt and remove her panties in a slow, steady motion. You don’t want to be too forceful and rush this.#$b#%You spread her legs with your hands and check Penny’s face to wordlessly ask permission. She nervously exhales and nods to you, giving you the go ahead. With her consent, you lean forwards.#$b#%Her ginger pubic hair is wild, contrasting her usual primness. You dive right into the briar patch and lick her labia, swirling around the entrance to her vagina.#$b#%Penny releases a sigh of contentment, and gently strokes the back of your head. You dip your tongue inside her and swirl it around.#$b#%Her sighs turn to gasps, then when you head north, to give her clit attention, her gasps turn into moans.#$b#Oh, @, how are you doing this to me?#$b#%The more you work her center, the louder her moans become. You never would have thought such a quiet, reserved girl could make such loud, untamed sounds.#$b#%Her cries reverberate throughout the area, bouncing off the walls. The hand that was once gently stroking your hair is now tangled in it and grabbing it like a lifeline.#$b#%She all but screams to the sky as a wave of clear fluid glazes your face. You lap up the fluid that remains coateing her, and then pull out and face her while wiping your mouth.#$b#I..I..wow. You made me experience parts of my sexuality I didn’t even know were there. I’m going to have to read up on this...",
				"get_eaten": ""
			}
		}
	]
}