{
	"Changes":[
		{
			"LogName":"Pierre",
			"Action":"EditData",
			"Target":"Characters/Dialogue/Pierre",
			"Entries": {
				"BJ": "Honestly, when you come into the store to buy seeds from me, I sometimes stare at you, imagining you on your knees, giving me all the pleasure in the world. It's nice to see I was right.#$b#I knew you were secretly into me. Don't worry, Caroline doesn't have to know. We don't do much together these days anyway. Well, not with each other.$s#$b#%*Pierre fidgets the the button and zipper of his pants before pulling out his dick. It's not that impressive, but nothing to laugh at. It looks slightly sad. #$b#%*You reach down and begin to preform a familiar back and forth motion. He smiles contently and leans his head back.#$b#%*As you start to increase the rhythm, Pierre immediately jerks his head back, his eyes wide*#$b#I'm close, @!#$b#%*You bring out the bottle but he finishes before you can get everything in. Only half of the white material manages to get into the jar*#$b#Sorry, @. I'm kind of sensitive and over eager. Since I don't get much action with Caroline, I don't exactly have any stamina built up, but we can go again tomorrow?#split#What? Who told you I was into that? Does Caroline know...?#$b#*You quickly calm down Pierre and kneel in front of him, waiting expectantly. He looks around and pulls out his hardening dick, accidentally poking you in the face*#$b#*You open your mouth and use your tongue to guide it inside, licking the head as you do so and eliciting a small groan of pleasure from him.*#$b#That's so good @. I had no idea you were such a great little cocksucker. I hope you're ready for this to become a regular thing because Caroline never does this for me.#$b#*It seems that Pierre likes talking dirty, so you lock eyes with him and use your hands to fondle his balls while he gets ready to ejaculate.*#$b#*At the last minute you pull a bottle out of your bag and start pumping his cock to make sure you get everything out of him.*"
			}
		}
	]
}