{
	"Changes":[
		{
			"LogName":"Robin",
			"Action":"EditData",
			"Target":"Characters/Dialogue/Robin",
			"Entries": {
				"milk_start": "Demetrius is always so...clinical...when he talks about my breasts. I wish he was as romantic as you!#$b#Of course you can collect my milk! Just...don't be surprised if I leave a damp spot on the chair when you're done!#$b#*As you massage her breast with your hand, filling up the jar, you make sure to play with her other nipple.*#$b#*Robin snakes a hand down her jeans and starts playing with herself, moaning and whimpering as her milk fills the jar. You finish milking her, but wait for her until she clenches her legs tightly and throws her head back.*#$b#That was wonderful...Come back, any time.",
				"eat_out": "Demetrius gets too wrapped up in the technicalities of it all, he never really just enjoys the moment. I'm game if you are?#$b#%Robin hops up on a counter and beckons you. You stride over and unbutton her jeans, and rip them and her panties right off, tossing them aside.#$b#%Robin grabs your head by the hair and guides you down. You find yourself right in the middle of her delicious pussy, and she’s already soaking.#$b#%Your tongue explores her, getting a taste of every nook and cranny, every fold. Robin sighs with pleasure. You find your way to her clit, and begin to tease it, flicking it with your tongue.#$b#%She moans and flops backwards on the counter, going from sitting to lying down, legs akimbo. Her hands move to her chest and she massages her own breasts while you work.#$b#%You slightly alter your rhythm, adding just a hint more pressure, and her moans become louder, almost evolving into screams.#$b#Yes...yes...YES!!#$b#%Robin shouts her continuous affirmations while you maintain that exact motion and pattern. Her hands are pounding, slapping the counter, her legs squeezing you tightly as she climaxes under your attention.#$b#%A stream of her fluids hit your face like a hose, making you start. Robin remains lying down, panting and smiling softly. After a moment she props herself up on her elbows and grins at you. #$b#Damn, you sure are a treat. Mind fetching my pants for me?",
				"get_eaten": ""
			}
		}
	]
}