{
	"Changes":[
		{
			"LogName":"Sandy",
			"Action":"EditData",
			"Target":"Characters/Dialogue/Sandy",
			"Entries": {
				"milk_start": "I knew you were too tempted to pass up this opportunity. There's a reason I'm called the flower of the desert, and I'd love to have you worship my breasts.#$b#%*She quickly sheds her top, baring her beautiful breasts to the hot desert air. Her skin glistens with moisture, and you can't help but lick a droplet of sweat that has caught on her nipple*#$b#%*Her nipples are perky for their size, and you give them both a quick suck to get the milk flowing, earning you a slight gasp from Sandy.#$b#That's exactly why I've been trying to get you to visit me, @. I knew you would be more than enough to satisfy me, so milk away.$h#$b#%*You start gently milking Sandy until she urges you to be more aggressive. You start tugging firmly on her nipples, causing her to stagger slightly as the pleasure rocks through her body*#$b#*The bottle quickly fills up, and Sandy is breathing hard by the time you are done*#$b#That was amazing, @. I'm going to go...relive myself. My pussy is gushing more than the Oasis, and I can't think straight when I'm this horny.$l",
				"eat_out": "The desert may be dry, but I’m sure not. And no, my name is not indicative of anything, either.#$b#%Sandy saunters over to her counter, casually pulling off her dress and tossing it aside. It appears that she had no underwear or bra underneath the blue gown.#$b#%Her breasts jiggle as she hops backwards to a sitting position. She leans back on her elbows, tosses her hair, and spreads her legs for you. As you get closer you see that Sandy was true to her word.#$b#%She’s definitely neither dry nor sandy, her pussy is shimmering wet. You’re not sure if that’s from arousal or wearing no panties in the heat of the desert, but you dive in anyway.#$b#%Her juices taste salty and a bit tangy, you tongue every inch of her nonetheless. Sandy grabs your head and pulls you upwards and kisses you, tasting her own pleasure in the process.#$b#Hmm, tasty. I hope you're enjoying the flavour as much as I do.#$b#%She licks your mouth before inserting her own tongue inside, grazing your teeth. She pulls away and guides you back to her groin. You’re a bit thrown off by this, and have to remember what you were doing before.#$b#%It doesn’t take too long to regain your senses and find a good rhythm on her clit. Sandy moans and brushes her hair back with her hand while you continue, and her moans increase in volume and frequency.#$b#Oh, @! Fuck! Right there!#$b#%One bonus of her shop being mostly empty: total privacy. Sandy loses all inhibition as she moans and screams your name. Her beautiful breasts heave with every breath, every pant.#$b#%You feel the muscles in her thighs contract as a warm clear liquid bursts out and covers you. You step back, leaving Sandy lying down, propped up on her elbows. She grins at you.#$b#There’s some cloth in the drawers there if you want to clean up...better hand me one too. I think I might just spend the rest of the day in the shop naked, I’m too warm for clothes.",
				"get_eaten": ""
			}
		}
	]
}