{
	"Changes":[
		{
			"LogName":"Sebastian",
			"Action":"EditData",
			"Target":"Characters/Dialogue/Sebastian",
			"Entries": {
				"BJ": "I could never say no to something like that from someone as attractive as you. I'm already in the palm of your hand figuratively, might as well make it literally, too.#$b#%When you reach down to Sebastian's groin, you find that his erection is already straining against his jeans, struggling to break free. You carefully pull down the zipper and his wood bursts out, free in the open air.#$b#%*Gently but firmly, you massage it, feeling it pulse under your touch. You crouch down and begin to trace your tongue around the shaft, swirling up to the tipe before fully inserting his cock into your warm mouth.#$b#%*As you move your head, you feel Sebastian's hands gingerly snake through your hair. His breathing becomes rapid and shaky.*#$b#@...whatever you do...don't stop...#$b#%You increase your tempo, faster and faster until suddenly Sebastian's hands grasp your hair in an intense moment of passion. He half-grunts, half-gasps as he fills you with his warm cum.#$b#%*You think about pulling away, but he holds you there, just for a few seconds, as if savoring the moment. Then he releases you and his cum spills out of your mouth, and you collect it into your jar.*#$b#You really are something else, @. You have no idea how glad I am to have you.$l#split#Have you ever thought about doing this with anyone else? Like, at the same time? I'm sure Abigail or Sam would be down if you ever want to?#$b#Not that I'm saying this isn't great. You're definitely really skilled...at this, your mouth is heavenly and so warm.#$b#*You and Sebastian spend several minutes locked together, mouth to groin, without only your sucking sounds being heard*#$b#Here it comes! I'm going to cum in your mouth!#$b#*You try and keep all of it in your mouth, but a lot of it explodes out of the side of your mouth and leaves you scraping the cum up with the bottle*"
			}
		}
	]
}