{
	"Changes":[
		{
			"LogName":"Shane",
			"Action":"EditData",
			"Target":"Characters/Dialogue/Shane",
			"Entries": {
				"BJ": "You know I'll never get over the idea that someone like you could be attracted to a guy like me. You're too good for me, you know.$h#$b#%*Despite this, Shane unbuckles his belt and lowers his shorts. He looks at you, almost disbelieving, as if he had found himself in some impossible dream.#$b#%*You maintain soft, tender, eye contact as your hand finds itself grasping his cock.#$b#%*Then, slowly, you kneel before him, your gaze not leaving his eyes. You watch as his eyelids flutter shut when you place your mouth around him*#$b#%*As you start using your tongue, your hands run down the front of his thighs, then upwards, under his shirt and onto his chest. Shane's hands find yours and he holds them there, against his torso*#$b#%*You pick up your pace, and his grip tightens around your fingers, pinning your palms to him. He seems to want to hold you to him, grounding himself in this reality with you*#$b#%Then, his eyes snap open, wide and alert. He trembles and you feel his cock pulsate in your mouth as it releases his ecstasy in waves. It's a lot, so you have to swallow some in order to make room.#$b#Holy fuck...@...#$b#%*It tastes watery and somehow spicy on your tongue, and the remnants make their way into your jar.*#$b#How did I get so lucky to find myself with you?$l#split#Are you joking? I don't know why you would offer that to me, it's not like I deserve it or anything. Are you sure?#$b#Oh, ok then, just don't expect anything special from me.#$b#*You pull down Shane's jeans and free his member from his underwear, taking a moment to admire it.* #$b#*He gets a little embarrassed, but when you lunge forward and take the whole thing in your mouth his insecurities vanish and he focusses on the sensations you are giving him*#$b#*He gets lost in a world consisting solely of you, himself and the wonderful things your tongue and lips are doing to him, and you see a slightly dazed smile form on his face*#$b#That feel amazing @, I can't believe you can give me such pleasure. I'm going to cum soon - get your bottle ready!"
			}
		}
	]
}