{
	"Changes":[
		{
			"LogName": "Sophia",
			"Action": "EditData",
			"Target": "Characters/Dialogue/Sophia",
			"Entries": {
				"milk_start": "Oh, hey there @. I have the perfect cosplay outfit for that, but I've been too embarrassed to wear it out of the house...It's...a sexy maid outfit, but it doesn't cover...my...#$b#My breasts very well. Oh god, I can't believe I told you. Please, if you promise not to laugh I'll change into it and you can milk me like a slutty maid.$s#$b#%*She returns quickly, and the costume is everything she described. A sexy french maid, replete with short, frilly skirt that barely covers her ass, and her breasts are almost completely exposed*#$b#%*She curtsies, and you command her to twirl for you. Her skirt flies up, and you are greeted with the typical anime panty shot.#$b#%*Wasting no time, you command her to stand still as you start to roughly milk her, eliciting feeble protests and a couple of requests to be gentler. You stop and ask her if she is ok#$b#@, please don't stop. I've wanted to do this for a long time, and acting is part of cosplay.$l#$b#%*You renew your milking, and her moans become louder. You notice her rubbing her thighs together, and as you finish milking her she shudders and climaxes*#$b#Thank you, @. That was a fantasy finally come true. Please...come back again and enjoy my 'services'",
				"eat_out": "Y-you’d really want to do that? For me? Okay…#$b#%Sophia shyly undoes her overalls and shimmies out of them, leaving them on the floor. You approach her, gently pick up her small frame, and place her on a table#$b#%You slide down her lacy pink panties and toss them aside. Sophia blushes at her vulnerable state. It takes a little physical coaxing from you but she cautiously opens her legs#$b#%You place a small but tender kiss on her lips, hoping to calming her nerves, but a deep blush spreads on her cheeks#$b#%You race the blush down her body, kissing her all the way, and she squirms adorably. You pause just below her waist, and give her a moment to prepare herself before continuing#$b#Oh, @, please don't make me wait any longer. I'm...ready for you.#$b#%You take the cue, starting at the base of her slit and slowly licking your way up, stopping just shy of her clit. She mewls in anticipation, and you use the tip of your tongue to rub her clit#$b#%You spend a few moments gently coaxing it out of it's hood, and Sofia writhes above you, gripping the table to try and control the sensations coursing through her petite frame#$b#Oh, @, this is too much!#$b#%Sophia shakes and whimpers under each oscillation of your tongue, clenching her eyes shut. She uses one hand to cover her mouth, trying to stifle the moans, but they still manage to slip through her fingers, audible in the open air#$b#%Sophia shudders and clenches her legs together tightly, trying to stop you from overloading her senses as she cums hard. Your chin suddenly becomes very wet as Sophia bathes you in her climax#$b#%As she slowly recovers, and relaxes the grip of her trembling legs, you patiently lick her clean with your tongue#$b#%When you are done you place a gentle kiss on her forehead, eliciting a squeak of surprise, bringing her back from the world she was lost in#$b#@...I don’t know what just happened there. I didn't think it would be so overwhelming, but I kind of want to do it again sometime? Is that okay?",
				"get_eaten": ""
			}
		}
	]
}