{
	"Changes":[
		{
			"LogName": "Susan",
			"Action": "EditData",
			"Target": "Characters/Dialogue/Susan",
			"Entries": {
				"milk_start": "@, in case you didn't notice I'm an agricultural farmer. I don't keep cows, so cannot provide you with any milk.#$b#Oh. I..I misunderstood you. You are welcome to try, but unless you have some kind of magic touch, I don't see how this will turn into more than groping.#$b#%*Determined to prove her wrong, you start rubbing her chest through her overalls. You quickly feel her nipples stiffen, standing proud and become visible even through the coarse fabric*#$b#%*Surprising Susan, a pair of dark, wet spots start appearing, and she pulls down her top to see that milk is coming out of her erect mounds*#$b#@!? I don't know how this is happening, but quickly, make sure you collect it all.$h#$b#%*She settles into a comfortable position, and you start gently pulling on her nipples, causing thick streams of milk to jet into the bottle. Susan looks on incredulously as the bottle fills*#$b#I never would have imagined that this was possible, but please come by again. My breasts will be ready for you any time.",
				"eat_out": "People tend to think that living in the mountains means I'm some kind of nun, but I love getting off just as the next person. Heck, I don't have to worry about the neighbours hearing me!#$b#It can get kind of boring with just me and my hands though, so I'm very appreciative of your offer#$b#%Susan undoes the snaps on her overalls and pushes them down, pausing when they catch on her full hips to remove her shirt and bra.#$b#%She hooks her thumbs in her underwear and, in one smooth, practised motion, drops everything to the floor. She stands confidently before you, her gorgeously dark skin bare.#$b#%She strides towards you, places her hands on your shoulders and firmly guides you to the ground, sitting astride your hips. She grins at you and tosses her curls, beautiful in the sun.#$b#%You try to take back some control, and pull her towards you, grasping her firm thighs with your hands as you bury your head in her warm pussy, noticing just how wet she is already.#$b#%You dig your tongue into her cunt and wiggle it, before moving up to her clit and giving it a little suck.#$b#Oh, @! I didn't expect you to be so aggressive. Not that I'm complaining, I like it rough.#$b#%You settle into a rhythm with Susan, and it's not long before she's moaning loudly, true to her word, letting you know just how much she is enjoying this.#$b#%Her hands weave trails through your hair, stroking and massaging mindlessly as the waves of pleasure wash over her. Her thighs start pressing in on your, and your world shrinks to between her legs.#$b#Keep going! I'm almost there, @. Make sure you suck my clit!#$b#%You barely hear her words of encouragement, but realise that she is very close. You rapidly flick your tongue over clit, and as she squeezes one last time you give it a slight nip.#$b#%She responds immediately, and her legs go slack, her body falling backwards onto your legs as her juices spraying into the air.#$b#Wow. I didn't know you had it in you, @. Just...wow.",
				"get_eaten": ""
			}
		}
	]
}