{
	"Changes":[
		{
			"LogName":"Wizard",
			"Action":"EditData",
			"Target":"Characters/Dialogue/Wizard",
			"Entries": {
				"BJ": "I am not used to the pleasures of the mortal world. It is a luxury I rarely partake in, as it keeps me distracted from communicating with the Elements. But...if you insist...I guess I could indulge myself.#$b#%The Wizard parts and lifts his robes, where his phallus hangs, flaccid. You gingerly reach forward and caress it, and it twitches under your touch. Then, in rising waves, it raises and extends.#$b#%*You massage it, increasing your firmness each stroke. When you bend down to suck his dick, something unexpected happens.#$b#%*You instantly find yourself connected to the Wizard's mind and consciousness, as if you had just plugged into his brain.#$b#%*You feel each sensation that he is experiencing at that moment. You can see yourself performing the movements, but instead of feeling it from your perspective, you are watching through his mind. You feel every flick of your tongue. Through his heavy breathing you hear the Wizard speak, as if from a distance...*#$b#@...what in the...?#$b#%Suddenly a massive tsunami of pleasure crashes into him, and through him, you. Next thing you know you are kneeling on the floor, shocked and stunned, with his cum on your face and yours in your pants.#$b#%*With a shaking hand you reach up to wipe off his climax, only to find it's not the usual white stuff. It's a prismatic liquid, so thin and light that you aren't sure if it's not a trick of the light.*#$b#....Honestly, @, I did not predict this. But I am more than willing to try again later. To further....study this phenomenon.#$b#%*He mutters a spell, and a bottle appears in your hand*#split#I am but a scholar in search of knowledge. Please, let us begin our 'study session' of this symbiosis.#$b#%The Wizard moves to arrange his robes, but you get there first, diving into the cloth and searching hungrily for his cock. It only had time to get halfway erect before you had syphoned it into your mouth*#$b#%*Then, the experience begins. You are melded into his mind, his body. Once again, you can perceive every minute motion your body makes.#$b#%*You feel your tongue making swirling motions around the base of the shaft, corkscrewing to the tip.#$b#%*You feel yourself suck the end, delicately, but intensely. You and he both sense the amount of pleasure rising, building, surging through your beings. It begins to peak.*#$b#Here..it comes…$h#$b#%Just as intense as the last time, you are plunged into a world of extreme pleasure. You are left breathless. You did not bother with a bottle before the climax, as the time it would take to bring it out was time wasted.#$b#%*You scrape the flowy, silky, colorful ejaculate into the container now. It takes time as you are still trembling. One of these days though, you will remember to bring a spare change of pants for yourself.*#$b#I'm pleased to share this with you. It's an...odd connection. It does, however, require further examination. I know I will see you soon again, @.$l"
			}
		}
	]
}