{
  "Name": "Mr. Qi's Essence", //The name you would like your object to have, this should be identical to the subfolder name.
  "Description": "A bottle of Mr. Qi's Essence. It shifts and sparkles in the light", //Description of the product.
  "Category": "Milk", //This should match the crop.json Type or for fruit trees should be one of the following: Flower, Fruit, Vegetable, Gem, Fish, Egg, Milk, Cooking, Crafting, Mineral, Meat, Metal, Junk, Syrup, MonsterLoot, ArtisanGoods, and Seeds.
  "Edibility": 150, //Edibility is for health, energy is calculated by the game. For inedibile items, set to -300.
  "Price": 290, //How much your item sells for.
  "IsColored": false, //(optional) Set this value to true if your product is colored. Primairly applies to flowers.
  "Recipe": null, //Set to null.
  "GiftTastes": //If an NPC isn't listed their gift taste will be neautral. If every NPC is specified you may remove unused categories.
  {
    "Love": [ "Maru" ], //Example of a single NPC
    "Like": [ "Krobus" ],
    "Neutral": null, //Example of `null`. Can also remove if not being used.
    "Dislike": [ "Pierre" ], //Example of multiple NPC
    "Hate": [ "Lewis" ]
  },
  "ContextTags": [
    "magic_essence_item",
    "human_cum_item",
    "MTV_item"
  ],

  // Localization

  "NameLocalization": {
    "es": "Esencia del Sr. Qi", //Spanish
    "ko": "Qi의 본질", //Korean
    "de": "Mr. Qis Essenz", //German
    "fr": "L'essence de M. Qi", //French
    "hu": "Qi úr lényege", //Hungarian
    "it": "L'essenza del signor Qi", //Italian
    "ja": "Qi氏の本質", //Japanese
    "pt": "Essência do Sr. Qi", //Portuguese
    "ru": "Суть мистера Ци", //Russian
    "tr": "Bay Qi'nin özü", //Turkish
    "zh": "齐先生的本质" //Chinese (Simplified)
  },
  "DescriptionLocalization": {
    "es": "Una botella de la esencia del Sr. Qi. Cambia y brilla a la luz", //Spanish
    "ko": "Qi의 본질 한 병. 그것은 빛의 변화와 반짝입니다", //Korean
    "de": "Eine Flasche von Mr. Qis Essenz. Es verschiebt und funkelt im Licht", //German
    "fr": "Une bouteille d'essence de M. Qi. Ça change et scintille dans la lumière", //French
    "hu": "Egy üveg Mr. Qi lényege. A fényben eltolódik és csillog", //Hungarian
    "it": "Una bottiglia dell'essenza del signor Qi. Si sposta e brilla nella luce", //Italian
    "ja": "Qi氏の本質のボトル。それは光の中でシフトして輝きます", //Japanese
    "pt": "Uma garrafa da essência do Sr. Qi. Ele muda e brilha na luz", //Portuguese
    "ru": "Бутылка сущности мистера Ци. Это смещается и сверкает в свете", //Russian
    "tr": "Bay Qi'nin özü bir şişe. Işıkta değişir ve parlar", //Turkish
    "zh": "一瓶Qi先生的本质。它在光线下移动和闪闪发光" //Chinese (Simplified)
  }
}